Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/ControlStructures.po
Languages: es_ar

source: Control Structures
es_ar: Estructuras de control

source: As we noted earlier, algorithms require two important control structures: iteration and selection. Both of these are supported by Python in various forms. The programmer can choose the statement that is most useful for the given circumstance.
es_ar: Como señalamos anteriormente, los algoritmos requieren dos estructuras de control importantes: la iteración y la selección. Ambos son compatibles con Python en varias formas. El programador puede elegir la declaración que es más útil para la circunstancia dada.

source: For iteration, Python provides a standard ``while`` statement and a very powerful ``for`` statement. The while statement repeats a body of code as long as a condition is true. For example,
es_ar: Para la iteración, Python proporciona una sentencia `` while`` y una sentencia `` for`` muy potente. La sentencia while repite un cuerpo de código siempre que una condición sea verdadera. Por ejemplo,

source: >>> counter = 1 >>> while counter <= 5: ... print("Hello, world") ... counter = counter + 1 Hello, world Hello, world Hello, world Hello, world Hello, world
es_ar: >>> contador = 1 >>> while contador <= 5: ... print("Hola, mundo") ... contador = contador + 1 Hola, mundo Hola, mundo Hola, mundo Hola, mundo Hola, mundo

source: prints out the phrase “Hello, world” five times. The condition on the ``while`` statement is evaluated at the start of each repetition. If the condition is ``True``, the body of the statement will execute. It is easy to see the structure of a Python ``while`` statement due to the mandatory indentation pattern that the language enforces.
es_ar: Imprime la frase "Hola, mundo" cinco veces. La condición en la sentencia `` while`` se evalúa al inicio de cada repetición. Si la condición es `` True``, el cuerpo de la sentencia se ejecutará. Es fácil ver la estructura de una sentencia `` while`` de Python debido al patrón de indentación obligatorio que el lenguaje hace cumplir.

source: The ``while`` statement is a very general purpose iterative structure that we will use in a number of different algorithms. In many cases, a compound condition will control the iteration. A fragment such as
es_ar: La sentencia `` while`` es una estructura iterativa de propósito general que usaremos en una serie de algoritmos diferentes. En muchos casos, una condición compuesta controlará la iteración. Un fragmento tal como

source: while counter <= 10 and not done: ...
es_ar: while contador <= 10 and not done: ...

source: would cause the body of the statement to be executed only in the case where both parts of the condition are satisfied. The value of the variable ``counter`` would need to be less than or equal to 10 and the value of the variable ``done`` would need to be ``False`` (``not False`` is ``True``) so that ``True and True`` results in ``True``.
es_ar: haría que el cuerpo de la declaración fuera ejecutado sólo en el caso en que se cumplan ambas partes de la condición. El valor de la variable `` contador`` tendría que ser menor o igual a 10 y el valor de la variable `` done`` tendría que ser `` False`` (`` not False`` es `` True``) de modo que `` True y True`` da como resultado `` True``.

source: Even though this type of construct is very useful in a wide variety of situations, another iterative structure, the ``for`` statement, can be used in conjunction with many of the Python collections. The ``for`` statement can be used to iterate over the members of a collection, so long as the collection is a sequence. So, for example,
es_ar: Aunque este tipo de construcción es muy útil en una amplia variedad de situaciones, otra estructura iterativa, la sentencia `` for``, puede usarse junto con muchas de las colecciones de Python. La sentencia `` for`` puede usarse para iterar sobre los miembros de una colección, siempre y cuando la colección sea una secuencia. Así por ejemplo,

source: >>> for item in [1,3,6,2,5]: ... print(item) ... 1 3 6 2 5
es_ar: >>> for valor in [1,3,6,2,5]: ... print(valor) ... 1 3 6 2 5

source: assigns the variable ``item`` to be each successive value in the list [1,3,6,2,5]. The body of the iteration is then executed. This works for any collection that is a sequence (lists, tuples, and strings).
es_ar: Asigna la variable `` valor`` a cada valor sucesivo de la lista [1,3,6,2,5]. Entonces se ejecuta el cuerpo de la iteración. Esto funciona para cualquier colección que es una secuencia (listas, tuplas y cadenas).

source: A common use of the ``for`` statement is to implement definite iteration over a range of values. The statement
es_ar: Un uso común de la instrucción `` for`` es implementar una iteración definida sobre un rango de valores. La declaración

source: >>> for item in range(5): ... print(item**2) ... 0 1 4 9 16 >>>
es_ar: >>> for valor in range(5): ... print(valor**2) ... 0 1 4 9 16 >>>

source: will perform the ``print`` function five times. The ``range`` function will return a range object representing the sequence 0,1,2,3,4 and each value will be assigned to the variable ``item``. This value is then squared and printed.
es_ar: realizará la función `` print`` cinco veces. La función `` range`` devolverá un objeto de rango que representa la secuencia 0,1,2,3,4 y cada valor se asignará a la variable `` valor``. Este valor es entonces impreso.

source: The other very useful version of this iteration structure is used to process each character of a string. The following code fragment iterates over a list of strings and for each string processes each character by appending it to a list. The result is a list of all the letters in all of the words.
es_ar: La otra versión muy útil de esta estructura de iteración se utiliza para procesar cada carácter de una cadena. El siguiente fragmento de código itera sobre una lista de cadenas y para cada cadena procesa cada carácter añadiéndolo a una lista. El resultado es una lista de todas las letras en todas las palabras.

source: data-caption='Processing Each Character in a List of Strings'
es_ar: data-caption = 'Procesamiento de cada carácter en una lista de cadenas'

source: wordlist = ['cat','dog','rabbit'] letterlist = [ ] for aword in wordlist: for aletter in aword: letterlist.append(aletter) print(letterlist)
es_ar: listadepalabras = ['gato','perro','conejo'] listadeletras = [ ] for aword in listadepalabras: for aletter in aword: listadeletras.append(aletter) print(listadeletras)

source: Selection statements allow programmers to ask questions and then, based on the result, perform different actions. Most programming languages provide two versions of this useful construct: the ``ifelse`` and the ``if``. A simple example of a binary selection uses the ``ifelse`` statement.
es_ar: Las sentencias de selección permiten a los programadores hacer preguntas y luego, basándose en el resultado, realizar diferentes acciones. La mayoría de los lenguajes de programación proporcionan dos versiones de esta construcción útil: el `` ifelse`` y el `` if``. Un ejemplo simple de una selección binaria utiliza la instrucción `` ifelse``.

source: if n<0: print("Sorry, value is negative") else: print(math.sqrt(n))
es_ar: if n<0: print("Lo siento, el valor es negativo") else: print(math.sqrt(n))

source: In this example, the object referred to by ``n`` is checked to see if it is less than zero. If it is, a message is printed stating that it is negative. If it is not, the statement performs the ``else`` clause and computes the square root.
es_ar: En este ejemplo, el objeto referido por `` n`` se comprueba para ver si es menor que cero. Si lo es, se imprime un mensaje indicando que es negativo. Si no es así, la instrucción realiza la cláusula `` else`` y calcula la raíz cuadrada.

source: Selection constructs, as with any control construct, can be nested so that the result of one question helps decide whether to ask the next. For example, assume that ``score`` is a variable holding a reference to a score for a computer science test.
es_ar: Las estructuras de selección, como con cualquier estructura de control, pueden anidarse de modo que el resultado de una pregunta ayude a decidir si se pregunta al siguiente. Por ejemplo, suponga que `` puntos`` es una variable que contiene una referencia a una puntuación para una prueba de ciencias de la computación.

source: if score >= 90: print('A') else: if score >=80: print('B') else: if score >= 70: print('C') else: if score >= 60: print('D') else: print('F')
es_ar: if puntos >= 90: print('A') else: if puntos >=80: print('B') else: if puntos >= 70: print('C') else: if puntos >= 60: print('D') else: print('F')

source: This fragment will classify a value called ``score`` by printing the letter grade earned. If the score is greater than or equal to 90, the statement will print ``A``. If it is not (``else``), the next question is asked. If the score is greater than or equal to 80 then it must be between 80 and 89 since the answer to the first question was false. In this case print ``B`` is printed. You can see that the Python indentation pattern helps to make sense of the association between ``if`` and ``else`` without requiring any additional syntactic elements.
es_ar: Este fragmento clasificará un valor llamado `` puntos`` mediante la impresión del grado de letra obtenido. Si la puntuación es mayor o igual a 90, la sentencia imprimirá `` A``. Si no es (`` else``), la siguiente pregunta es hecha. Si la puntuación es mayor o igual a 80, entonces debe estar entre 80 y 89, ya que la respuesta a la primera pregunta era falsa. En este caso se imprimirá la letra "B". Puede ver que el patrón de indentación de Python ayuda a dar sentido a la asociación entre `` if`` y `` else`` sin necesidad de elementos sintácticos adicionales.

source: An alternative syntax for this type of nested selection uses the ``elif`` keyword. The ``else`` and the next ``if`` are combined so as to eliminate the need for additional nesting levels. Note that the final ``else`` is still necessary to provide the default case if all other conditions fail.
es_ar: Una sintaxis alternativa para este tipo de selección anidada utiliza la palabra clave `` elif``. El `` else`` y el siguiente `` if`` se combinan para eliminar la necesidad de niveles de anidamiento adicionales. Tenga en cuenta que el final `` else`` sigue siendo necesario para proporcionar el caso por defecto si todas las demás condiciones fallan.

source: if score >= 90: print('A') elif score >=80: print('B') elif score >= 70: print('C') elif score >= 60: print('D') else: print('F')
es_ar: if puntos >= 90: print('A') elif puntos >=80: print('B') elif puntos >= 70: print('C') elif puntos >= 60: print('D') else: print('F')

source: Python also has a single way selection construct, the ``if`` statement. With this statement, if the condition is true, an action is performed. In the case where the condition is false, processing simply continues on to the next statement after the ``if``. For example, the following fragment will first check to see if the value of a variable ``n`` is negative. If it is, then it is modified by the absolute value function. Regardless, the next action is to compute the square root.
es_ar: Python también tiene una construcción de selección de una sola vía, la instrucción `` if``. Con esta sentencia, si la condición es verdadera, se realiza una acción. En el caso de que la condición sea falsa, el procesamiento simplemente continúa con la siguiente declaración después de `` if``. Por ejemplo, el siguiente fragmento comprobará primero si el valor de una variable `` n`` es negativo. Si lo es, entonces es modificado por la función de valor absoluto. Independientemente, la siguiente acción es calcular la raíz cuadrada.

source: Self Check
es_ar: Autochequeo o verificación

source: Test your understanding of what we have covered so far by trying the following exercise. Modify the code from Activecode 8 so that the final list only contains a single copy of each letter.
es_ar: Pruebe su comprensión de lo que hemos cubierto hasta ahora al intentar el siguiente ejercicio. Modifique el código de Activecode 8 para que la lista final sólo contenga una sola copia de cada letra.

source: # the answer is: ['c', 'a', 't', 'd', 'o', 'g', 'r', 'b', 'i']
es_ar: # la respuesta es: ['c', 'a', 't', 'd', 'o', 'g', 'r', 'b', 'i']

source: <div id="list_unique" class="video_popup" > <video controls preload="none" poster="../_static/videothumb.png"> <source src="http://media.interactivepython.org/pythondsVideos/list_unique.mov" type="video/mp4"></source> <source src="http://media.interactivepython.org/pythondsVideos/list_unique.webm" type="video/webm"></source> No supported video types </video> </div> <script> jQuery(function($) { var rb = new RunestoneBase(); $('#list_unique_thumb').click(function(e) { $('#list_unique').show(); $('#list_unique_thumb').hide(); rb.logBookEvent({'event':'video','act':'play','div_id': 'list_unique'}); // Log the run event }); $('#list_unique video').one("click", function(){ this.play(); }); $('#list_unique video').one("play", function(){ rb.logBookEvent({'event':'video','act':'play','div_id': 'list_unique'}); }); }); </script>
es_ar: <div id="list_unique" class="video_popup" > <video controls preload="none" poster="../_static/videothumb.png"> <source src="http://media.interactivepython.org/pythondsVideos/list_unique.mov" type="video/mp4"></source> <source src="http://media.interactivepython.org/pythondsVideos/list_unique.webm" type="video/webm"></source> Tipo de video no soportado </video> </div> <script> jQuery(function($) { var rb = new RunestoneBase(); $('#list_unique_thumb').click(function(e) { $('#list_unique').show(); $('#list_unique_thumb').hide(); rb.logBookEvent({'event':'video','act':'play','div_id': 'list_unique'}); // Log the run event }); $('#list_unique video').one("click", function(){ this.play(); }); $('#list_unique video').one("play", function(){ rb.logBookEvent({'event':'video','act':'play','div_id': 'list_unique'}); }); }); </script>

source: Returning to lists, there is an alternative method for creating a list that uses iteration and selection constructs known as a **list comprehension**. A list comprehension allows you to easily create a list based on some processing or selection criteria. For example, if we would like to create a list of the first 10 perfect squares, we could use a ``for`` statement:
es_ar: Regresando a las listas, existe un método alternativo para crear una lista que usa construcciones de iteración y selección conocidas como ** comprensión de listas **. Una comprensión de la lista le permite crear fácilmente una lista basada en algunos criterios de procesamiento o selección. Por ejemplo, si queremos crear una lista de los primeros 10 cuadrados perfectos, podríamos usar una sentencia `` for``:

source: Using a list comprehension, we can do this in one step as
es_ar: Usando una lista de comprensión, podemos hacer esto en un paso como

source: The variable ``x`` takes on the values 1 through 10 as specified by the ``for`` construct. The value of ``x*x`` is then computed and added to the list that is being constructed. The general syntax for a list comprehension also allows a selection criteria to be added so that only certain items get added. For example,
es_ar: La variable `` x`` toma los valores de 1 a 10 especificados por el constructor `` for``. El valor de `` x * x`` se calcula y se agrega a la lista que se está construyendo. La sintaxis general para una comprensión de listas también permite agregar un criterio de selección para que solo se agreguen ciertos elementos. Por ejemplo,

source: This list comprehension constructed a list that only contained the squares of the odd numbers in the range from 1 to 10. Any sequence that supports iteration can be used within a list comprehension to construct a new list.
es_ar: Esta lista de comprensión construyó una lista que sólo contenía los cuadrados de los números impares en el rango de 1 a 10. Cualquier secuencia que apoya la iteración se puede utilizar dentro de una lista de comprensión para construir una nueva lista.

source: Test your understanding of list comprehensions by redoing Activecode 8 using list comprehensions. For an extra challenge, see if you can figure out how to remove the duplicates.
es_ar: Pruebe su comprensión de las listas de comprensiones rehaciendo Activecode 8 utilizando listas comprensivas. Para un desafío adicional, vea si puede averiguar cómo eliminar los duplicados.

source: # the answer is: ['c', 'a', 't', 'd', 'o', 'g', 'r', 'a', 'b', 'b', 'i', 't']
es_ar: # la respuesta es: ['c', 'a', 't', 'd', 'o', 'g', 'r', 'a', 'b', 'b', 'i', 't']

source: <div id="listcomp" class="video_popup" > <video controls preload="none" poster="../_static/videothumb.png"> <source src="http://media.interactivepython.org/pythondsVideos/listcomp.mov" type="video/mp4"></source> <source src="http://media.interactivepython.org/pythondsVideos/listcomp.webm" type="video/webm"></source> No supported video types </video> </div> <script> jQuery(function($) { var rb = new RunestoneBase(); $('#listcomp_thumb').click(function(e) { $('#listcomp').show(); $('#listcomp_thumb').hide(); rb.logBookEvent({'event':'video','act':'play','div_id': 'listcomp'}); // Log the run event }); $('#listcomp video').one("click", function(){ this.play(); }); $('#listcomp video').one("play", function(){ rb.logBookEvent({'event':'video','act':'play','div_id': 'listcomp'}); }); }); </script>
es_ar: <div id="listcomp" class="video_popup" > <video controls preload="none" poster="../_static/videothumb.png"> <source src="http://media.interactivepython.org/pythondsVideos/listcomp.mov" type="video/mp4"></source> <source src="http://media.interactivepython.org/pythondsVideos/listcomp.webm" type="video/webm"></source> Tipo de video no soportado </video> </div> <script> jQuery(function($) { var rb = new RunestoneBase(); $('#listcomp_thumb').click(function(e) { $('#listcomp').show(); $('#listcomp_thumb').hide(); rb.logBookEvent({'event':'video','act':'play','div_id': 'listcomp'}); // Log the run event }); $('#listcomp video').one("click", function(){ this.play(); }); $('#listcomp video').one("play", function(){ rb.logBookEvent({'event':'video','act':'play','div_id': 'listcomp'}); }); }); </script>
