Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/DefiningFunctions.po
Languages: es_ar

source: Defining Functions
es_ar: Definición de funciones

source: The earlier example of procedural abstraction called upon a Python function called ``sqrt`` from the math module to compute the square root. In general, we can hide the details of any computation by defining a function. A function definition requires a name, a group of parameters, and a body. It may also explicitly return a value. For example, the simple function defined below returns the square of the value you pass into it.
es_ar: El ejemplo anterior del procedimiento llamó a una función de Python llamada ``sqrt`` del módulo de matemáticas para calcular la raíz cuadrada. En general, podemos ocultar los detalles de cualquier cálculo definiendo una función. Una definición de función requiere un nombre, un grupo de parámetros y un cuerpo. También puede devolver un valor explícitamente. Por ejemplo, la función simple definida a continuación devuelve el cuadrado del valor que se pasa a él.

source: >>> def square(n): ... return n**2 ... >>> square(3) 9 >>> square(square(3)) 81 >>>
es_ar: >>> def cuadrado(n): ... return n**2 ... >>> cuadrado(3) 9 >>> cuadrado(cuadrado(3)) 81 >>>

source: The syntax for this function definition includes the name, ``square``, and a parenthesized list of formal parameters. For this function, ``n`` is the only formal parameter, which suggests that ``square`` needs only one piece of data to do its work. The details, hidden “inside the box,” simply compute the result of ``n**2`` and return it. We can invoke or call the ``square`` function by asking the Python environment to evaluate it, passing an actual parameter value, in this case, ``3``. Note that the call to ``square`` returns an integer that can in turn be passed to another invocation.
es_ar: La sintaxis para esta definición de función incluye el nombre, ``cuadrado``, y una lista entre paréntesis de parámetros formales. Para esta función, ``n`` es el único parámetro formal, lo que sugiere que ``cuadrado`` sólo necesita una pieza de datos para realizar su trabajo. Los detalles, ocultos "dentro de la caja", simplemente calcula el resultado de ``n**2`` y devuélvalo. Podemos invocar o llamar a la función ``cuadrado`` pidiendo al entorno Python que la evalúe, pasando un valor de parámetro real, en este caso ``3``. Tenga en cuenta que la llamada a ``cuadrado`` devuelve un entero que a su vez puede pasar a otra invocación.

source: We could implement our own square root function by using a well-known technique called “Newton’s Method.” Newton’s Method for approximating square roots performs an iterative computation that converges on the correct value. The equation :math:`newguess = \frac {1}{2} * (oldguess + \frac {n}{oldguess})` takes a value :math:`n` and repeatedly guesses the square root by making each :math:`newguess` the :math:`oldguess` in the subsequent iteration. The initial guess used here is :math:`\frac {n}{2}`. :ref:`Listing 1 <lst_root>` shows a function definition that accepts a value :math:`n` and returns the square root of :math:`n` after making 20 guesses. Again, the details of Newton’s Method are hidden inside the function definition and the user does not have to know anything about the implementation to use the function for its intended purpose. :ref:`Listing 1 <lst_root>` also shows the use of the # character as a comment marker. Any characters that follow the # on a line are ignored.
es_ar: Podríamos implementar nuestra propia función de raíz cuadrada usando una técnica bien conocida llamada "Método de Newton". El Método de Newton para aproximar raíces cuadradas realiza un cálculo iterativo que converge en el valor correcto. La ecuación :math:`newguess = \frac {1}{2} * (oldguess + \frac {n}{oldguess})` toma un valor :math:`n` y repetidamente adivina la raíz cuadrada haciendo cada una :math:`newguess` el :math:`oldguess` en la iteración siguiente. La suposición inicial utilizada aquí es: math: `\ frac {n} {2}`. :ref:`Listado 1 <lst_root>` muestra una definición de función que acepta un valor :math:`n` y devuelve la raíz cuadrada de :math:`n` después de hacer 20 conjeturas. Una vez más, los detalles del Método de Newton están ocultos dentro de la definición de la función y el usuario no tiene que saber nada sobre la implementación para usar la función para su propósito. :ref:`Listing 1 <lst_root>` también muestra el uso del carácter # como marcador de comentario. Los caracteres que siguen al # de una línea se ignoran.

source: **Listing 1**
es_ar: **Listado 1**

source: def squareroot(n): root = n/2 #initial guess will be 1/2 of n for k in range(20): root = (1/2)*(root + (n / root)) return root
es_ar: def raizcuadrada(n): raiz = n/2 #El valor inicial será 1/2 de n for k in range(20): raiz = (1/2)*(raiz + (n / raiz)) return raiz

source: >>>squareroot(9) 3.0 >>>squareroot(4563) 67.549981495186216 >>>
es_ar: >>>raizcuadrada(9) 3.0 >>>raizcuadrada(4563) 67.549981495186216 >>>

source: Self Check
es_ar: Auto-Evaluación

source: Here's a self check that really covers everything so far. You may have heard of the infinite monkey theorem? The theorem states that a monkey hitting keys at random on a typewriter keyboard for an infinite amount of time will almost surely type a given text, such as the complete works of William Shakespeare. Well, suppose we replace a monkey with a Python function. How long do you think it would take for a Python function to generate just one sentence of Shakespeare? The sentence we'll shoot for is: "methinks it is like a weasel"
es_ar: He aquí un auto chequeo que realmente cubre todo hasta ahora. Usted puede haber oído hablar del teorema del mono infinito? El teorema dice que un mono golpeando las teclas al azar en un teclado de máquina de escribir por una cantidad infinita de tiempo casi seguramente escribirá un texto dado, como las obras completas de William Shakespeare. Bueno, supongamos que reemplazar un mono con una función de Python. ¿Cuánto tiempo crees que tomaría una función de Python generar sólo una oración de Shakespeare? La frase que vamos a disparar es: "me parece que es como una comadreja"

source: You're not going to want to run this one in the browser, so fire up your favorite Python IDE. The way we'll simulate this is to write a function that generates a string that is 27 characters long by choosing random letters from the 26 letters in the alphabet plus the space. We'll write another function that will score each generated string by comparing the randomly generated string to the goal.
es_ar: No vas a querer ejecutar este en el navegador, en tu IDE de Python favorito. La forma en que vamos a simular esto es escribir una función que genera una cadena que tiene 27 caracteres de largo al elegir letras aleatorias de las 26 letras del alfabeto más el espacio. Escribiremos otra función que anotará cada cadena generada comparando la cadena generada aleatoriamente con la meta.

source: A third function will repeatedly call generate and score, then if 100% of the letters are correct we are done. If the letters are not correct then we will generate a whole new string.To make it easier to follow your program's progress this third function should print out the best string generated so far and its score every 1000 tries.
es_ar: Una tercera función llamará repetidamente generar y anotar, entonces si el 100% de las letras son correctas estamos hechos. Si las letras no son correctas entonces generaremos una nueva cadena entera. Para hacer más fácil seguir el progreso de su programa esta tercera función debe imprimir la mejor secuencia generada hasta ahora y su puntuación cada 1000 intentos.

source: Self Check Challenge
es_ar: Desafío de Auto-Evaluación

source: See if you can improve upon the program in the self check by keeping letters that are correct and only modifying one character in the best string so far. This is a type of algorithm in the class of 'hill climbing' algorithms, that is we only keep the result if it is better than the previous one.
es_ar: Vea si puede mejorar el programa en la auto-comprobación manteniendo las letras correctas y modificando sólo un carácter en la mejor cadena hasta ahora. Este es un tipo de algoritmo en la clase de algoritmos de 'escalada en colina', es decir, solo mantenemos el resultado si es mejor que el anterior.

source: <div id="monkeyvid" class="video_popup" > <video controls preload="none" poster="../_static/videothumb.png"> <source src="http://media.interactivepython.org/pythondsVideos/monkeys.mov" type="video/mp4"></source> <source src="http://media.interactivepython.org/pythondsVideos/monkeys.webm" type="video/webm"></source> No supported video types </video> </div> <script> jQuery(function($) { var rb = new RunestoneBase(); $('#monkeyvid_thumb').click(function(e) { $('#monkeyvid').show(); $('#monkeyvid_thumb').hide(); rb.logBookEvent({'event':'video','act':'play','div_id': 'monkeyvid'}); // Log the run event }); $('#monkeyvid video').one("click", function(){ this.play(); }); $('#monkeyvid video').one("play", function(){ rb.logBookEvent({'event':'video','act':'play','div_id': 'monkeyvid'}); }); }); </script>
es_ar: <div id="monkeyvid" class="video_popup" > <video controls preload="none" poster="../_static/videothumb.png"> <source src="http://media.interactivepython.org/pythondsVideos/monkeys.mov" type="video/mp4"></source> <source src="http://media.interactivepython.org/pythondsVideos/monkeys.webm" type="video/webm"></source> Tipo de video no soportado </video> </div> <script> jQuery(function($) { var rb = new RunestoneBase(); $('#monkeyvid_thumb').click(function(e) { $('#monkeyvid').show(); $('#monkeyvid_thumb').hide(); rb.logBookEvent({'event':'video','act':'play','div_id': 'monkeyvid'}); // Log the run event }); $('#monkeyvid video').one("click", function(){ this.play(); }); $('#monkeyvid video').one("play", function(){ rb.logBookEvent({'event':'video','act':'play','div_id': 'monkeyvid'}); }); }); </script>
