Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/GettingStartedwithData.po
Languages: es_ar

source: Of these, ``split`` will be very useful for processing data. ``split`` will take a string and return a list of strings using the split character as a division point. In the example, ``v`` is the division point. If no division is specified, the split method looks for whitespace characters such as tab, newline and space.
es_ar: De estos, `` split`` será muy útil para el procesamiento de datos. `` Split`` tomará una cadena y devolverá una lista de cadenas usando el carácter dividido como un punto de división. En el ejemplo, `` v`` es el punto de división. Si no se especifica ninguna división, el método split busca caracteres de espacios en blanco como tabulación, nueva línea y espacio.

source: **Table 4: Methods Provided by Strings in Python**
es_ar: **Tabla 4: Métodos proporcionados por cadenas en Python**

source: ``astring.center(w)``
es_ar: ``unacadena.center(w)``

source: Returns a string centered in a field of size ``w``
es_ar: Devuelve una cadena centrada en un campo de tamaño `` w``

source: ``astring.count(item)``
es_ar: ``unacadena.count(item)``

source: Returns the number of occurrences of ``item`` in the string
es_ar: Devuelve el número de ocurrencias de `` item`` en la cadena

source: ``astring.ljust(w)``
es_ar: ``unacadena.ljust(w)``

source: Returns a string left-justified in a field of size ``w``
es_ar: Devuelve una cadena justificada a la izquierda en un campo de tamaño `` w``

source: ``astring.lower()``
es_ar: ``unacadena.lower()``

source: Returns a string in all lowercase
es_ar: Devuelve una cadena en minúsculas

source: ``astring.rjust(w)``
es_ar: ``unacadena.rjust(w)``

source: Returns a string right-justified in a field of size ``w``
es_ar: Devuelve una cadena justificada a la derecha en un campo de tamaño `` w``

source: ``astring.find(item)``
es_ar: ``unacadena.find(item)``

source: ``astring.split(schar)``
es_ar: ``unacadena.split(schar)``

source: Splits a string into substrings at ``schar``
es_ar: Divide una cadena en subcadenas en `` schar``

source: A major difference between lists and strings is that lists can be modified while strings cannot. This is referred to as **mutability**. Lists are mutable; strings are immutable. For example, you can change an item in a list by using indexing and assignment. With a string that change is not allowed.
es_ar: Una diferencia importante entre listas y cadenas es que las listas se pueden modificar mientras que las cadenas no pueden. Esto se conoce como ** mutabilidad **. Las listas son mutables; Las cadenas son inmutables. Por ejemplo, puede cambiar un elemento de una lista mediante la indexación y la asignación. Con una cadena que el cambio no está permitido.

source: >>> myList [1, 3, True, 6.5] >>> myList[0]=2**10 >>> myList [1024, 3, True, 6.5] >>> >>> myName 'David' >>> myName[0]='X' Traceback (most recent call last): File "<pyshell#84>", line 1, in -toplevel- myName[0]='X' TypeError: object doesn't support item assignment >>>
es_ar: >>> miLista [1, 3, True, 6.5] >>> miLista[0]=2**10 >>> miLista [1024, 3, True, 6.5] >>> >>> miNombre 'David' >>> miNombre[0]='X' Traceback (most recent call last): File "<pyshell#84>", line 1, in -toplevel- miNombre[0]='X' TypeError: object doesn't support item assignment >>>

source: Tuples are very similar to lists in that they are heterogeneous sequences of data. The difference is that a tuple is immutable, like a string. A tuple cannot be changed. Tuples are written as comma-delimited values enclosed in parentheses. As sequences, they can use any operation described above. For example,
es_ar: Las tuplas son muy similares a las listas en que son secuencias heterogéneas de datos. La diferencia es que una tupla es inmutable, como una cadena. No se puede cambiar una tupla. Las tuplas se escriben como valores delimitados por comas entre paréntesis. Como secuencias, pueden utilizar cualquier operación descrita anteriormente. Por ejemplo,

source: >>> myTuple = (2,True,4.96) >>> myTuple (2, True, 4.96) >>> len(myTuple) 3 >>> myTuple[0] 2 >>> myTuple * 3 (2, True, 4.96, 2, True, 4.96, 2, True, 4.96) >>> myTuple[0:2] (2, True) >>>
es_ar: >>> miTupla = (2,True,4.96) >>> miTupla (2, True, 4.96) >>> len(miTupla) 3 >>> miTupla[0] 2 >>> miTupla * 3 (2, True, 4.96, 2, True, 4.96, 2, True, 4.96) >>> miTupla[0:2] (2, True) >>>

source: However, if you try to change an item in a tuple, you will get an error. Note that the error message provides location and reason for the problem.
es_ar: Sin embargo, si intenta cambiar un elemento en una tupla, obtendrá un error. Tenga en cuenta que el mensaje de error proporciona la ubicación y la razón del problema.

source: >>> myTuple[1]=False Traceback (most recent call last): File "<pyshell#137>", line 1, in -toplevel- myTuple[1]=False TypeError: object doesn't support item assignment >>>
es_ar: >>> miTupla[1]=False Traceback (most recent call last): File "<pyshell#137>", line 1, in -toplevel- miTupla[1]=False TypeError: object doesn't support item assignment >>>

source: A set is an unordered collection of zero or more immutable Python data objects. Sets do not allow duplicates and are written as comma-delimited values enclosed in curly braces. The empty set is represented by ``set()``. Sets are heterogeneous, and the collection can be assigned to a variable as below.
es_ar: Un conjunto es una colección desordenada de objetos de datos Python cero o más inmutable. Los conjuntos no permiten duplicados y se escriben como valores delimitados por comas entre corchetes. El conjunto vacío está representado por `` set () ``. Los conjuntos son heterogéneos y la colección se puede asignar a una variable como se muestra a continuación.

source: >>> {3,6,"cat",4.5,False} {False, 4.5, 3, 6, 'cat'} >>> mySet = {3,6,"cat",4.5,False} >>> mySet {False, 4.5, 3, 6, 'cat'} >>>
es_ar: >>> {3,6,"cat",4.5,False} {False, 4.5, 3, 6, 'cat'} >>> miConjunto = {3,6,"cat",4.5,False} >>> miConjunto {False, 4.5, 3, 6, 'cat'} >>>

source: Even though sets are not considered to be sequential, they do support a few of the familiar operations presented earlier. :ref:`Table 5 <tab_setops>` reviews these operations and the following session gives examples of their use.
es_ar: Aunque los conjuntos no se consideran secuenciales, sí apoyan algunas de las operaciones conocidas presentadas anteriormente. : Ref: `Tabla 5 <tab_setops>` revisa estas operaciones y la siguiente sesión da ejemplos de su uso.

source: **Table 5: Operations on a Set in Python**
es_ar: **Tabla 5: Operaciones en un conjunto en Python**

source: Set membership
es_ar: Establecer pertenencia (ser miembro)

source: Returns the cardinality of the set
es_ar: Devuelve la cardinalidad del conjunto

source: ``aset | otherset``
es_ar: ``Conjunto1 | Conjunto2``

source: Returns a new set with all elements from both sets
es_ar: Devuelve un nuevo conjunto con todos los elementos de ambos conjuntos

source: ``aset & otherset``
es_ar: ``Conjunto1 & Conjunto2``

source: Returns a new set with only those elements common to both sets
es_ar: Devuelve un nuevo conjunto con sólo los elementos comunes a ambos conjuntos

source: ``aset - otherset``
es_ar: ``Conjunto1 - Conjunto2``

source: Returns a new set with all items from the first set not in second
es_ar: Devuelve un nuevo conjunto con todos los elementos del primer conjunto no en el segundo

source: ``aset <= otherset``
es_ar: ``Conjunto1 <= Conjunto2``

source: Asks whether all elements of the first set are in the second
es_ar: Pregunta si todos los elementos del primer conjunto están en el segundo

source: >>> mySet {False, 4.5, 3, 6, 'cat'} >>> len(mySet) 5 >>> False in mySet True >>> "dog" in mySet False >>>
es_ar: >>> miConjunto {False, 4.5, 3, 6, 'gato'} >>> len(miConjunto) 5 >>> False in miConjunto True >>> "perro" in miConjunto False >>>

source: Sets support a number of methods that should be familiar to those who have worked with them in a mathematics setting. :ref:`Table 6 <tab_setmethods>` provides a summary. Examples of their use follow. Note that ``union``, ``intersection``, ``issubset``, and ``difference`` all have operators that can be used as well.
es_ar: Los conjuntos soportan una serie de métodos que deben ser familiares para aquellos que han trabajado con ellos en un entorno de matemáticas. : Ref: `Tabla 6 <tab_setmethods>` proporciona un resumen. Siguen ejemplos de su uso. Tenga en cuenta que `` union``, `` intersection``, `` issubset`` y `` difference`` tienen operadores que también se pueden usar.

source: **Table 6: Methods Provided by Sets in Python**
es_ar: **Tabla 6: Métodos proporcionados por conjuntos en Python**

source: ``aset.union(otherset)``
es_ar: ``Conjunto1.union(Conjunto2)``

source: ``aset.intersection(otherset)``
es_ar: ``Conjunto1.intersection(Conjunto2)``

source: ``aset.difference(otherset)``
es_ar: ``Conjunto1.difference(Conjunto2)``

source: Returns a new set with all items from first set not in second
es_ar: Devuelve un nuevo conjunto con todos los elementos del primer conjunto no en el segundo

source: ``aset.issubset(otherset)``
es_ar: ``Conjunto1.issubset(Conjunto2)``

source: Asks whether all elements of one set are in the other
es_ar: Pregunta si todos los elementos de un conjunto están en el otro

source: ``aset.add(item)``
es_ar: ``Conjunto1add(item)``

source: Adds item to the set
es_ar: Añade un elemento al conjunto

source: ``aset.remove(item)``
es_ar: ``Conjunto1.remove(item)``

source: Removes item from the set
es_ar: Elimina el elemento del conjunto

source: ``aset.pop()``
es_ar: ``Conjunto1.pop()``

source: Removes an arbitrary element from the set
es_ar: Elimina un elemento arbitrario del conjunto

source: ``aset.clear()``
es_ar: ``Conjunto1.clear()``

source: Removes all elements from the set
es_ar: Elimina todos los elementos del conjunto

source: >>> mySet {False, 4.5, 3, 6, 'cat'} >>> yourSet = {99,3,100} >>> mySet.union(yourSet) {False, 4.5, 3, 100, 6, 'cat', 99} >>> mySet | yourSet {False, 4.5, 3, 100, 6, 'cat', 99} >>> mySet.intersection(yourSet) {3} >>> mySet & yourSet {3} >>> mySet.difference(yourSet) {False, 4.5, 6, 'cat'} >>> mySet - yourSet {False, 4.5, 6, 'cat'} >>> {3,100}.issubset(yourSet) True >>> {3,100}<=yourSet True >>> mySet.add("house") >>> mySet {False, 4.5, 3, 6, 'house', 'cat'} >>> mySet.remove(4.5) >>> mySet {False, 3, 6, 'house', 'cat'} >>> mySet.pop() False >>> mySet {3, 6, 'house', 'cat'} >>> mySet.clear() >>> mySet set() >>>
es_ar: >>> miConjunto {False, 4.5, 3, 6, 'gato'} >>> tuConjunto = {99,3,100} >>> miConjunto.union(tuConjunto) {False, 4.5, 3, 100, 6, 'gato', 99} >>> miConjunto | tuConjunto {False, 4.5, 3, 100, 6, 'gato', 99} >>> miConjunto.intersection(tuConjunto) {3} >>> miConjunto & tuConjunto {3} >>> miConjunto.difference(tuConjunto) {False, 4.5, 6, 'gato'} >>> miConjunto - tuConjunto {False, 4.5, 6, 'gato'} >>> {3,100}.issubset(tuConjunto) True >>> {3,100}<=tuConjunto True >>> miConjunto.add("casa") >>> miConjunto {False, 4.5, 3, 6, 'casa', 'gato'} >>> miConjunto.remove(4.5) >>> miConjunto {False, 3, 6, 'casa', 'gato'} >>> miConjunto.pop() False >>> miConjunto {3, 6, 'casa', 'gato'} >>> miConjunto.clear() >>> miConjunto set() >>>

source: Our final Python collection is an unordered structure called a **dictionary**. Dictionaries are collections of associated pairs of items where each pair consists of a key and a value. This key-value pair is typically written as key:value. Dictionaries are written as comma-delimited key:value pairs enclosed in curly braces. For example,
es_ar: Nuestra colección final de Python es una estructura desordenada llamada ** diccionario **. Los diccionarios son colecciones de pares asociados de elementos en los que cada par consta de una clave y un valor. Este par clave-valor suele escribirse como clave: valor. Los diccionarios se escriben como clave delimitada por comas: pares de valores encerrados entre llaves. Por ejemplo,

source: >>> capitals = {'Iowa':'DesMoines','Wisconsin':'Madison'} >>> capitals {'Wisconsin': 'Madison', 'Iowa': 'DesMoines'} >>>
es_ar: >>> capitales = {'Iowa':'DesMoines','Wisconsin':'Madison'} >>> capitales {'Wisconsin': 'Madison', 'Iowa': 'DesMoines'} >>>

source: We can manipulate a dictionary by accessing a value via its key or by adding another key-value pair. The syntax for access looks much like a sequence access except that instead of using the index of the item we use the key value. To add a new value is similar.
es_ar: Podemos manipular un diccionario accediendo a un valor a través de su clave o añadiendo otro par clave-valor. La sintaxis para el acceso se parece mucho a un acceso de secuencia, excepto que en lugar de utilizar el índice del elemento que utilizamos el valor de la clave. Para agregar un nuevo valor es similar.

source: data-caption='Using a Dictionary'
es_ar: data-caption = 'Uso de un diccionario'

source: capitals = {'Iowa':'DesMoines','Wisconsin':'Madison'} print(capitals['Iowa']) capitals['Utah']='SaltLakeCity' print(capitals) capitals['California']='Sacramento' print(len(capitals)) for k in capitals: print(capitals[k]," is the capital of ", k)
es_ar: capitales = {'Iowa':'DesMoines','Wisconsin':'Madison'} print(capitales['Iowa']) capitales['Utah']='SaltLakeCity' print(capitales) capitales['California']='Sacramento' print(len(capitales)) for k in capitales: print(capitales[k]," es la capital de", k)

source: It is important to note that the dictionary is maintained in no particular order with respect to the keys. The first pair added (``'Utah':`` ``'SaltLakeCity'``) was placed first in the dictionary and the second pair added (``'California':`` ``'Sacramento'``) was placed last. The placement of a key is dependent on the idea of “hashing,” which will be explained in more detail in Chapter 4. We also show the length function performing the same role as with previous collections.
es_ar: Es importante tener en cuenta que el diccionario se mantiene sin orden particular con respecto a las teclas. El primer par añadido (`` Utah ': `` `` `SaltLakeCity'``) fue colocado en primer lugar en el diccionario y el segundo par añadido (` `` `` `` `` `'Sacramento'`` de California) fue Colocado en último lugar. La colocación de una clave depende de la idea de "hashing", que se explicará con más detalle en el Capítulo 4. También mostramos la función de longitud que cumple el mismo papel que con las colecciones anteriores.

source: Dictionaries have both methods and operators. :ref:`Table 7 <tab_dictopers>` and :ref:`Table 8 <tab_dictmethods>` describe them, and the session shows them in action. The ``keys``, ``values``, and ``items`` methods all return objects that contain the values of interest. You can use the ``list`` function to convert them to lists. You will also see that there are two variations on the ``get`` method. If the key is not present in the dictionary, ``get`` will return ``None``. However, a second, optional parameter can specify a return value instead.
es_ar: Los diccionarios tienen métodos y operadores. : Ref: `Tabla 7 <tab_dictopers>` y: ref: `Tabla 8 <tab_dictmethods>` describirlos, y la sesión los muestra en acción. Los métodos `` keys``, `` values`` y `` items`` todos los objetos de retorno que contienen los valores de interés. Puede utilizar la función `` list`` para convertirlas en listas. También verá que hay dos variaciones en el método `` get``. Si la clave no está presente en el diccionario, `` get`` devolverá `` None``. Sin embargo, un segundo parámetro opcional puede especificar un valor devuelto.

source: **Table 7: Operators Provided by Dictionaries in Python**
es_ar: **Tabla 7: Operadores proporcionados por los diccionarios en Python**

source: ``myDict[k]``
es_ar: ``miDiccionario[k]``

source: Returns the value associated with ``k``, otherwise its an error
es_ar: Devuelve el valor asociado con `` k``, de lo contrario es un error

source: ``key in adict``
es_ar: ``key in unDiccionario``

source: Returns ``True`` if key is in the dictionary, ``False`` otherwise
es_ar: Devuelve `` True`` si la clave está en el diccionario, `` False`` de lo contrario

source: del ``adict[key]``
es_ar: del ``unDiccionario[key]``

source: Removes the entry from the dictionary
es_ar: Elimina la entrada del diccionario

source: >>> phoneext={'david':1410,'brad':1137} >>> phoneext {'brad': 1137, 'david': 1410} >>> phoneext.keys() dict_keys(['brad', 'david']) >>> list(phoneext.keys()) ['brad', 'david'] >>> phoneext.values() dict_values([1137, 1410]) >>> list(phoneext.values()) [1137, 1410] >>> phoneext.items() dict_items([('brad', 1137), ('david', 1410)]) >>> list(phoneext.items()) [('brad', 1137), ('david', 1410)] >>> phoneext.get("kent") >>> phoneext.get("kent","NO ENTRY") 'NO ENTRY' >>>
es_ar: >>> extension_telefono={'david':1410,'brad':1137} >>> extension_telefono {'brad': 1137, 'david': 1410} >>> extension_telefono.keys() dict_keys(['brad', 'david']) >>> list(extension_telefono.keys()) ['brad', 'david'] >>> extension_telefono.values() dict_values([1137, 1410]) >>> list(extension_telefono.values()) [1137, 1410] >>> extension_telefono.items() dict_items([('brad', 1137), ('david', 1410)]) >>> list(extension_telefono.items()) [('brad', 1137), ('david', 1410)] >>> extension_telefono.get("kent") >>> extension_telefono.get("kent","NO ENTRY") 'NO ENTRY' >>>

source: **Table 8: Methods Provided by Dictionaries in Python**
es_ar: **Tabla 8: Métodos proporcionados por los diccionarios en Python**

source: ``adict.keys()``
es_ar: ``unDiccionario.keys()``

source: Returns the keys of the dictionary in a dict_keys object
es_ar: Devuelve las claves del diccionario en un objeto dict_keys

source: ``adict.values()``
es_ar: ``unDiccionario.values()``

source: Returns the values of the dictionary in a dict_values object
es_ar: Devuelve los valores del diccionario en un objeto dict_values

source: ``adict.items()``
es_ar: ``unDiccionario.items()``

source: Returns the key-value pairs in a dict_items object
es_ar: Devuelve los pares clave-valor en un objeto dict_items

source: ``adict.get(k)``
es_ar: ``unDiccionario.get(k)``

source: Returns the value associated with ``k``, ``None`` otherwise
es_ar: Devuelve el valor asociado con `` k``, `` None`` de lo contrario

source: ``adict.get(k,alt)``
es_ar: ``unDiccionario.get(k,alt)``

source: Returns the value associated with ``k``, ``alt`` otherwise
es_ar: Devuelve el valor asociado con `` k``, `` alt`` de lo contrario

source: This workspace is provided for your convenience. You can use this activecode window to try out anything you like.
es_ar: Este espacio de trabajo se proporciona para su conveniencia. Puedes usar esta ventana de activecode para probar lo que quieras.
