Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/GettingStartedwithData.po
Languages: es_ar

source: Getting Started with Data
es_ar: Comenzando con Datos

source: We stated above that Python supports the object-oriented programming paradigm. This means that Python considers data to be the focal point of the problem-solving process. In Python, as well as in any other object-oriented programming language, we define a **class** to be a description of what the data look like (the state) and what the data can do (the behavior). Classes are analogous to abstract data types because a user of a class only sees the state and behavior of a data item. Data items are called **objects** in the object-oriented paradigm. An object is an instance of a class.
es_ar: Hemos dicho anteriormente que Python apoya el paradigma de programación orientado a objetos. Esto significa que Python considera que los datos son el punto focal del proceso de resolución de problemas. En Python, así como en cualquier otro lenguaje de programación orientado a objetos, definimos una ** clase ** como una descripción de lo que parecen los datos (el estado) y lo que los datos pueden hacer (el comportamiento). Las clases son análogas a los tipos de datos abstractos porque un usuario de una clase sólo ve el estado y el comportamiento de un elemento de datos. Los elementos de datos se denominan ** objetos ** en el paradigma orientado a objetos. Un objeto es una instancia de una clase.

source: Built-in Atomic Data Types
es_ar: Tipos de datos atómicos incorporados

source: We will begin our review by considering the atomic data types. Python has two main built-in numeric classes that implement the integer and floating point data types. These Python classes are called ``int`` and ``float``. The standard arithmetic operations, +, -, \*, /, and \*\* (exponentiation), can be used with parentheses forcing the order of operations away from normal operator precedence. Other very useful operations are the remainder (modulo) operator, %, and integer division, //. Note that when two integers are divided, the result is a floating point. The integer division operator returns the integer portion of the quotient by truncating any fractional part.
es_ar: Comenzaremos nuestra revisión considerando los tipos de datos atómicos. Python tiene dos clases numéricas incorporadas principales que implementan los tipos de datos enteros y de punto flotante. Estas clases de Python se llaman `` int`` y `` float``. Las operaciones aritméticas estándar, +, -, \ *, /, y \ * \ * (exponenciación), pueden usarse con paréntesis forzando el orden de las operaciones lejos de la precedencia normal del operador. Otras operaciones muy útiles son el resto (módulo) operador,% y división entera, //. Tenga en cuenta que cuando dos enteros se dividen, el resultado es un punto flotante. El operador de división entera devuelve la porción entera del cociente truncando cualquier parte fraccional.

source: data-caption='Basic Arithmetic Operators'
es_ar: data-caption = 'Operadores Aritméticos Básicos'

source: The boolean data type, implemented as the Python ``bool`` class, will be quite useful for representing truth values. The possible state values for a boolean object are ``True`` and ``False`` with the standard boolean operators, ``and``, ``or``, and ``not``.
es_ar: El tipo de datos booleano, implementado como la clase `` bool`` de Python, será muy útil para representar valores de verdad. Los posibles valores de estado para un objeto booleano son `` True`` y `` False`` con los operadores booleanos estándar, `` and``, `` or`` y `` not``.

source: Boolean data objects are also used as results for comparison operators such as equality (==) and greater than (:math:`>`). In addition, relational operators and logical operators can be combined together to form complex logical questions. :ref:`Table 1 <tab_relational>` shows the relational and logical operators with examples shown in the session that follows.
es_ar: Los objetos de datos booleanos también se utilizan como resultados para operadores de comparación como igualdad (==) y mayor que (: math: `>`). Además, los operadores relacionales y los operadores lógicos pueden combinarse para formar preguntas lógicas complejas. : Ref: `Tabla 1 <tab_relational>` muestra los operadores relacionales y lógicos con ejemplos mostrados en la sesión que sigue.

source: **Table 1: Relational and Logical Operators**
es_ar: **Tabla 1: Operadores relacionales y lógicos**

source: **Operation Name**
es_ar: **Nombre de la Operación**

source: **Operator**
es_ar: **Operador**

source: **Explanation**
es_ar: **Explicación**

source: less than
es_ar: menor que

source: Less than operator
es_ar: Menor como operador

source: greater than
es_ar: mayor que

source: Greater than operator
es_ar: Mayor como operador

source: less than or equal
es_ar: menor o igual que

source: Less than or equal to operator
es_ar: Menor o igual que como operador

source: greater than or equal
es_ar: mayor o igual que

source: Greater than or equal to operator
es_ar: Mayor o igual que como operador

source: equal
es_ar: igualdad

source: Equality operator
es_ar: Igualdad como operador

source: not equal
es_ar: no igual

source: Not equal operator
es_ar: Operador No igual

source: logical and
es_ar: y lógico

source: Both operands True for result to be True
es_ar: Ambos operandos True para que el resultado sea True

source: logical or
es_ar: o lógico

source: One or the other operand is True for the result to be True
es_ar: Uno u otro operando es True para que el resultado sea True

source: logical not
es_ar: no lógico

source: Negates the truth value, False becomes True, True becomes False
es_ar: Niega el valor de la verdad, False se convierte en True, True se convierte en False

source: data-caption='Basic Relational and Logical Operators'
es_ar: data-caption = 'Operadores Básicos Relacionales y Lógicos'

source: Identifiers are used in programming languages as names. In Python, identifiers start with a letter or an underscore (_), are case sensitive, and can be of any length. Remember that it is always a good idea to use names that convey meaning so that your program code is easier to read and understand.
es_ar: Los identificadores se utilizan en los lenguajes de programación como nombres. En Python, los identificadores comienzan con una letra o un guión bajo (_), son sensibles a mayúsculas y minúsculas, y pueden ser de cualquier longitud. Recuerde que siempre es una buena idea usar nombres que transmitan significado para que su código de programa sea más fácil de leer y entender.

source: A Python variable is created when a name is used for the first time on the left-hand side of an assignment statement. Assignment statements provide a way to associate a name with a value. The variable will hold a reference to a piece of data and not the data itself. Consider the following session:
es_ar: Una variable Python se crea cuando se utiliza un nombre por primera vez en el lado izquierdo de una instrucción de asignación. Las sentencias de asignación proporcionan una forma de asociar un nombre a un valor. La variable contendrá una referencia a una pieza de datos y no a los datos en sí. Considere la siguiente sesión:

source: >>> theSum = 0 >>> theSum 0 >>> theSum = theSum + 1 >>> theSum 1 >>> theSum = True >>> theSum True
es_ar: >>> laSuma = 0 >>> laSuma 0 >>> laSuma = laSuma + 1 >>> laSuma 1 >>> laSuma = True >>> laSuma True

source: The assignment statement ``theSum = 0`` creates a variable called ``theSum`` and lets it hold the reference to the data object ``0`` (see :ref:`Figure 3 <fig_assignment1>`). In general, the right-hand side of the assignment statement is evaluated and a reference to the resulting data object is “assigned” to the name on the left-hand side. At this point in our example, the type of the variable is integer as that is the type of the data currently being referred to by ``theSum``. If the type of the data changes (see :ref:`Figure 4 <fig_assignment2>`), as shown above with the boolean value ``True``, so does the type of the variable (``theSum`` is now of the type boolean). The assignment statement changes the reference being held by the variable. This is a dynamic characteristic of Python. The same variable can refer to many different types of data.
es_ar: La instrucción de asignación `` laSuma = 0`` crea una variable llamada `` laSuma`` y permite mantener la referencia al objeto de datos `` 0`` (ver: ref: `Figura 3 <fig_assignment1_es>`). En general, se evalúa el lado derecho de la instrucción de asignación y se asigna una referencia al objeto de datos resultante al nombre del lado izquierdo. En este punto de nuestro ejemplo, el tipo de la variable es entero, ya que es el tipo de los datos a los que se refiere actualmente `` laSuma``. Si el tipo de datos cambia (véase: ref: `Figura 4 <fig_assignment2_es>`), como se muestra arriba con el valor booleano `` True``, también el tipo de la variable (`` laSuma`` es ahora de El tipo booleano). La instrucción de asignación cambia la referencia que está siendo retenida por la variable. Esta es una característica dinámica de Python. La misma variable puede referirse a muchos tipos diferentes de datos.

source: .. image:: Introduction/Figures/assignment1.png
es_ar: .. image:: Introduction/Figures/assignment1_es.png

source: Figure 3: Variables Hold References to Data Objects
es_ar: Figura 3: Referencias de variables a objetos de datos

source: .. image:: Introduction/Figures/assignment2.png
es_ar: .. image:: Introduction/Figures/assignment2_es.png

source: Figure 4: Assignment Changes the Reference
es_ar: Figura 4: Asignación Cambia la Referencia

source: Built-in Collection Data Types
es_ar: Colección de tipos de datos incorporados

source: In addition to the numeric and boolean classes, Python has a number of very powerful built-in collection classes. Lists, strings, and tuples are ordered collections that are very similar in general structure but have specific differences that must be understood for them to be used properly. Sets and dictionaries are unordered collections.
es_ar: Además de las clases numéricas y booleanas, Python tiene una serie de clases de recopilación muy potentes. Las listas, cadenas y tuplas son colecciones ordenadas que son muy similares en la estructura general pero tienen diferencias específicas que deben ser entendidas para que sean usadas correctamente. Conjuntos y diccionarios son colecciones no ordenadas.

source: A **list** is an ordered collection of zero or more references to Python data objects. Lists are written as comma-delimited values enclosed in square brackets. The empty list is simply ``[ ]``. Lists are heterogeneous, meaning that the data objects need not all be from the same class and the collection can be assigned to a variable as below. The following fragment shows a variety of Python data objects in a list.
es_ar: Una ** lista ** es una colección ordenada de cero o más referencias a objetos de datos Python. Las listas se escriben como valores delimitados por comas entre corchetes. La lista vacía es simplemente `` [] ``. Las listas son heterogéneas, lo que significa que los objetos de datos no necesitan ser todos de la misma clase y la colección se puede asignar a una variable como a continuación. El siguiente fragmento muestra una variedad de objetos de datos de Python en una lista.

source: >>> [1,3,True,6.5] [1, 3, True, 6.5] >>> myList = [1,3,True,6.5] >>> myList [1, 3, True, 6.5]
es_ar: >>> [1,3,True,6.5] [1, 3, True, 6.5] >>> miLista = [1,3,True,6.5] >>> miLista [1, 3, True, 6.5]

source: Note that when Python evaluates a list, the list itself is returned. However, in order to remember the list for later processing, its reference needs to be assigned to a variable.
es_ar: Tenga en cuenta que cuando Python evalúa una lista, se devuelve la lista. Sin embargo, para recordar la lista para un procesamiento posterior, su referencia debe asignarse a una variable.

source: Since lists are considered to be sequentially ordered, they support a number of operations that can be applied to any Python sequence. :ref:`Table 2 <tab_sequence>` reviews these operations and the following session gives examples of their use.
es_ar: Dado que las listas se consideran ordenadas secuencialmente, admiten varias operaciones que se pueden aplicar a cualquier secuencia de Python. : Ref: `Tabla 2 <tab_sequence>` revisa estas operaciones y la siguiente sesión da ejemplos de su uso.

source: **Table 2: Operations on Any Sequence in Python**
es_ar: **Tabla 2: Operaciones en cualquier secuencia en Python**

source: indexing
es_ar: indexación

source: Access an element of a sequence
es_ar: Acceder a un elemento de una secuencia

source: concatenation
es_ar: concatenación

source: Combine sequences together
es_ar: Combinar secuencias entre sí

source: repetition
es_ar: repetición

source: Concatenate a repeated number of times
es_ar: Concatenar un número repetido de veces

source: membership
es_ar: miembros de

source: in
es_ar: en

source: Ask whether an item is in a sequence
es_ar: Pregunta si un elemento está en una secuencia

source: length
es_ar: longitud

source: Ask the number of items in the sequence
es_ar: Pregunta el número de elementos en la secuencia

source: slicing
es_ar: cadena

source: Extract a part of a sequence
es_ar: Extrae parte de una secuencia

source: Note that the indices for lists (sequences) start counting with 0. The slice operation, myList[1:3], returns a list of items starting with the item indexed by 1 up to but not including the item indexed by 3.
es_ar: Tenga en cuenta que los índices de listas (secuencias) empiezan a contar con 0. La operación de corte, miLista [1: 3], devuelve una lista de elementos que comienzan con el elemento indexado por 1 hasta el elemento indexado por 3.

source: Sometimes, you will want to initialize a list. This can quickly be accomplished by using repetition. For example,
es_ar: A veces, usted querrá inicializar una lista. Esto se puede lograr rápidamente usando la repetición. Por ejemplo,

source: >>> myList = [0] * 6 >>> myList [0, 0, 0, 0, 0, 0]
es_ar: >>> miLista = [0] * 6 >>> miLista [0, 0, 0, 0, 0, 0]

source: One very important aside relating to the repetition operator is that the result is a repetition of references to the data objects in the sequence. This can best be seen by considering the following session:
es_ar: Un aspecto muy importante relacionado con el operador de repetición es que el resultado es una repetición de referencias a los objetos de datos en la secuencia. Esto se puede ver mejor considerando la siguiente sesión:

source: data-caption='Repetition of References'
es_ar: data-caption = 'Repetición de referencias'

source: myList = [1,2,3,4] A = [myList]*3 print(A) myList[2]=45 print(A)
es_ar: miLista = [1,2,3,4] A = [miLista]*3 print(A) miLista[2]=45 print(A)

source: The variable ``A`` holds a collection of three references to the original list called ``myList``. Note that a change to one element of ``myList`` shows up in all three occurrences in ``A``.
es_ar: La variable `` A`` contiene una colección de tres referencias a la lista original llamada `` miLista``. Tenga en cuenta que un cambio a un elemento de `` miLista`` aparece en las tres ocurrencias en `` A``.

source: Lists support a number of methods that will be used to build data structures. :ref:`Table 3 <tab_listmethods>` provides a summary. Examples of their use follow.
es_ar: Las listas admiten varios métodos que se utilizarán para crear estructuras de datos. : Ref: `Tabla 3 <tab_listmethods>` proporciona un resumen. Siguen ejemplos de su uso.

source: **Table 3: Methods Provided by Lists in Python**
es_ar: **Tabla 3: Métodos proporcionados por Listas en Python**

source: **Method Name**
es_ar: **Nombre del método**

source: **Use**
es_ar: **Uso**

source: ``alist.append(item)``
es_ar: ``unalista.append(item)``

source: Adds a new item to the end of a list
es_ar: Agrega un nuevo elemento al final de una lista

source: ``alist.insert(i,item)``
es_ar: ``unalista.insert(i,item)``

source: Inserts an item at the ith position in a list
es_ar: Inserta un elemento en la i-ésima posición en una lista

source: ``alist.pop()``
es_ar: ``unalista.pop()``

source: Removes and returns the last item in a list
es_ar: Elimina y devuelve el último elemento de una lista

source: ``alist.pop(i)``
es_ar: ``unalista.pop(i)``

source: Removes and returns the ith item in a list
es_ar: Elimina y devuelve el i-ésimo ítem en una lista

source: ``alist.sort()``
es_ar: ``unalista.sort()``

source: Modifies a list to be sorted
es_ar: Modifica una lista para ordenarla

source: ``alist.reverse()``
es_ar: ``unalista.reverse()``

source: Modifies a list to be in reverse order
es_ar: Modifica una lista para que esté en orden inverso

source: ``del alist[i]``
es_ar: ``del unalista[i]``

source: Deletes the item in the ith position
es_ar: Elimina el elemento en la i-ésima posición

source: ``alist.index(item)``
es_ar: ``unalista.index(item)``

source: Returns the index of the first occurrence of ``item``
es_ar: Devuelve el índice de la primera aparición de `` item``

source: ``alist.count(item)``
es_ar: ``unalista.count(item)``

source: Returns the number of occurrences of ``item``
es_ar: Devuelve el número de apariciones de `` item``

source: ``alist.remove(item)``
es_ar: ``unalista.remove(item)``

source: Removes the first occurrence of ``item``
es_ar: Elimina la primera aparición de `` item``

source: data-caption='Examples of List Methods'
es_ar: data-caption = 'Ejemplos de métodos de lista'

source: myList = [1024, 3, True, 6.5] myList.append(False) print(myList) myList.insert(2,4.5) print(myList) print(myList.pop()) print(myList) print(myList.pop(1)) print(myList) myList.pop(2) print(myList) myList.sort() print(myList) myList.reverse() print(myList) print(myList.count(6.5)) print(myList.index(4.5)) myList.remove(6.5) print(myList) del myList[0] print(myList)
es_ar: miLista = [1024, 3, True, 6.5] miLista.append(False) print(miLista) miLista.insert(2,4.5) print(miLista) print(miLista.pop()) print(miLista) print(miLista.pop(1)) print(miLista) miLista.pop(2) print(miLista) miLista.sort() print(miLista) miLista.reverse() print(miLista) print(miLista.count(6.5)) print(miLista.index(4.5)) miLista.remove(6.5) print(miLista) del miLista[0] print(miLista)

source: You can see that some of the methods, such as ``pop``, return a value and also modify the list. Others, such as ``reverse``, simply modify the list with no return value. ``pop`` will default to the end of the list but can also remove and return a specific item. The index range starting from 0 is again used for these methods. You should also notice the familiar “dot” notation for asking an object to invoke a method. ``myList.append(False)`` can be read as “ask the object ``myList`` to perform its ``append`` method and send it the value ``False``.” Even simple data objects such as integers can invoke methods in this way.
es_ar: Puede ver que algunos de los métodos, como `` pop``, devuelven un valor y también modifican la lista. Otros, como `` reverse``, simplemente modifican la lista sin valor de retorno. `` Pop`` aparecerá por defecto al final de la lista, pero también puede eliminar y devolver un elemento específico. El intervalo de índices que comienza a partir de 0 se utiliza de nuevo para estos métodos. También debe notar la notación familiar de "punto" para pedir a un objeto que invoque un método. `` miLista.append (False) `` puede ser leído como "pida al objeto` `miLista`` que realice su método` `append`` y envíenle el valor` `False``. Incluso objetos de datos simples como Los enteros pueden invocar métodos de esta manera.

source: In this fragment we are asking the integer object ``54`` to execute its ``add`` method (called ``__add__`` in Python) and passing it ``21`` as the value to add. The result is the sum, ``75``. Of course, we usually write this as ``54+21``. We will say much more about these methods later in this section.
es_ar: En este fragmento pedimos al objeto entero `` 54`` que ejecute su método `` add`` (llamado `` __add__`` en Python) y lo pasemos `` 21`` como el valor a añadir. El resultado es la suma, `` 75``. Por supuesto, solemos escribir esto como "54 + 21". Vamos a decir mucho más sobre estos métodos más adelante en esta sección.

source: One common Python function that is often discussed in conjunction with lists is the ``range`` function. ``range`` produces a range object that represents a sequence of values. By using the ``list`` function, it is possible to see the value of the range object as a list. This is illustrated below.
es_ar: Una función común de Python que se discute a menudo junto con las listas es la función `` range``. `` Range`` produce un objeto range que representa una secuencia de valores. Mediante el uso de la función `` list``, es posible ver el valor del objeto range como una lista. Esto se ilustra a continuación.

source: The range object represents a sequence of integers. By default, it will start with 0. If you provide more parameters, it will start and end at particular points and can even skip items. In our first example, ``range(10)``, the sequence starts with 0 and goes up to but does not include 10. In our second example, ``range(5,10)`` starts at 5 and goes up to but not including 10. ``range(5,10,2)`` performs similarly but skips by twos (again, 10 is not included).
es_ar: El objeto de rango representa una secuencia de enteros. De forma predeterminada, se iniciará con 0. Si se proporcionan más parámetros, se iniciará y finalizará en determinados puntos e incluso puede saltar elementos. En nuestro primer ejemplo, `` range (10) ``, la secuencia comienza con 0 y va hasta pero no incluye 10. En nuestro segundo ejemplo, `` range (5,10) `` comienza en 5 y sube A, pero sin incluir 10. `` rango (5,10,2) `` funciona de manera similar, pero salta por dos (nuevamente, 10 no está incluido).

source: **Strings** are sequential collections of zero or more letters, numbers and other symbols. We call these letters, numbers and other symbols *characters*. Literal string values are differentiated from identifiers by using quotation marks (either single or double).
es_ar: ** Las cadenas ** son colecciones secuenciales de cero o más letras, números y otros símbolos. Llamamos a estas letras, números y otros símbolos * caracteres *. Los valores de las cadenas literales se diferencian de los identificadores mediante comillas (simples o dobles).

source: >>> "David" 'David' >>> myName = "David" >>> myName[3] 'i' >>> myName*2 'DavidDavid' >>> len(myName) 5 >>>
es_ar: >>> "David" 'David' >>> miNombre = "David" >>> miNombre[3] 'i' >>> miNombre*2 'DavidDavid' >>> len(miNombre) 5 >>>

source: Since strings are sequences, all of the sequence operations described above work as you would expect. In addition, strings have a number of methods, some of which are shown in :ref:`Table 4<tab_stringmethods>`. For example,
es_ar: Dado que las cadenas son secuencias, todas las operaciones de secuencia descritas anteriormente funcionan como cabría esperar. Además, las cadenas tienen una serie de métodos, algunos de los cuales se muestran en: ref: `Tabla 4 <tab_stringmethods>`. Por ejemplo,

source: >>> myName 'David' >>> myName.upper() 'DAVID' >>> myName.center(10) ' David ' >>> myName.find('v') 2 >>> myName.split('v') ['Da', 'id']
es_ar: >>> miNombre 'David' >>> miNombre.upper() 'DAVID' >>> miNombre.center(10) ' David ' >>> miNombre.find('v') 2 >>> miNombre.split('v') ['Da', 'id']
