Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/ObjectOrientedProgramminginPythonDefiningClasses.po
Languages: es_419

source: The only behavior that the ``BinaryGate`` class adds is the ability to get the values from the two input lines. Since these values come from some external place, we will simply ask the user via an input statement to provide them. The same implementation occurs for the ``UnaryGate`` class except that there is only one input line.
es_419: El único comportamiento que la clase ``CompuertaBinaria`` añade es la capacidad de obtener los valores de las dos líneas de entrada. Dado que estos valores vienen de algún lugar externo, simplemente pediremos al usuario a través de una declaración de entrada para proporcionarlos. La misma implementación se produce para la clase ``CompuertaUnaria`` excepto que sólo hay una línea de entrada.

source: Now that we have a general class for gates depending on the number of input lines, we can build specific gates that have unique behavior. For example, the ``AndGate`` class will be a subclass of ``BinaryGate`` since AND gates have two input lines. As before, the first line of the constructor calls upon the parent class constructor (``BinaryGate``), which in turn calls its parent class constructor (``LogicGate``). Note that the ``AndGate`` class does not provide any new data since it inherits two input lines, one output line, and a label.
es_419: Ahora que tenemos una clase general para puertas dependiendo del número de líneas de entrada, podemos construir puertas específicas que tengan un comportamiento único. Por ejemplo, la clase ``CompuertaY`` (AND) será una subclase de ``CompuertaBinaria``, ya que las puertas AND tienen dos líneas de entrada. Como antes, la primera línea del constructor llama al constructor de la clase padre (``CompuertaBinaria``), que a su vez llama al constructor de la clase padre (``CompuertaLogica``). Tenga en cuenta que la clase ``CompuertaY`` no proporciona ningún dato nuevo, ya que hereda dos líneas de entrada, una línea de salida y una etiqueta.

source: **Listing 11**
es_419: **Listado 11**

source: class AndGate(BinaryGate): def __init__(self,n): BinaryGate.__init__(self,n) def performGateLogic(self): a = self.getPinA() b = self.getPinB() if a==1 and b==1: return 1 else: return 0
es_419: class CompuertaY(CompuertaBinaria): def __init__(self,n): CompuertaBinaria.__init__(self, n) def realizarCompuertaLogica(self): a = self.darPinA() b = self.darPinB() if a==1 and b==1: return 1 else: return 0

source: The only thing ``AndGate`` needs to add is the specific behavior that performs the boolean operation that was described earlier. This is the place where we can provide the ``performGateLogic`` method. For an AND gate, this method first must get the two input values and then only return 1 if both input values are 1. The complete class is shown in :ref:`Listing 11 <lst_andgateclass>`.
es_419: Lo único que ``CompuertaY`` necesita agregar es el comportamiento específico que realiza la operación booleana que se describió anteriormente. Este es el lugar donde podemos proporcionar el método ``realizarCompuertaLogica``. Para una puerta AND, este método primero debe obtener los dos valores de entrada y luego sólo devuelve 1 si ambos valores de entrada son 1. La clase completa se muestra en :ref:`Listado 11 <lst_andgateclass>`.

source: We can show the ``AndGate`` class in action by creating an instance and asking it to compute its output. The following session shows an ``AndGate`` object, ``g1``, that has an internal label ``"G1"``. When we invoke the ``getOutput`` method, the object must first call its ``performGateLogic`` method which in turn queries the two input lines. Once the values are provided, the correct output is shown.
es_419: Podemos mostrar la clase ``CompuertaY`` en acción creando una instancia y pidiéndole que calcule su salida. La sesión siguiente muestra un objeto ``CompuertaY``, ``g1``, que tiene una etiqueta interna ``"G1"``. Cuando invocamos el método ``darSalida``, el objeto debe llamar primero a su método ``realizarCompuertaLogica`` que a su vez consulta las dos líneas de entrada. Una vez que se proporcionan los valores, se muestra la salida correcta.

source: >>> g1 = AndGate("G1") >>> g1.getOutput() Enter Pin A input for gate G1-->1 Enter Pin B input for gate G1-->0 0
es_419: >>> g1 = CompuertaY("G1") >>> g1.darSalida() Ingrese la entrada para el Pin A de la compuerta G1-->1 Ingrese la entrada para el Pin B de la compuerta G1-->0 0

source: The same development can be done for OR gates and NOT gates. The ``OrGate`` class will also be a subclass of ``BinaryGate`` and the ``NotGate`` class will extend the ``UnaryGate`` class. Both of these classes will need to provide their own ``performGateLogic`` functions, as this is their specific behavior.
es_419: El mismo desarrollo se puede hacer para puertas OR y puertas NOT. La clase ``CompuertaO`` (OR) también será una subclase de ``CompuertaBinaria`` y la clase ``CompuertaNO`` (NOT) extenderá la clase ``CompuertaUnaria``. Ambas clases tendrán que proporcionar sus propias funciones ``realizarCompuertaLogica``, ya que este es su comportamiento específico.

source: We can use a single gate by first constructing an instance of one of the gate classes and then asking the gate for its output (which will in turn need inputs to be provided). For example:
es_419: Podemos utilizar una sola puerta construyendo primero una instancia de una de las clases de puerta y luego pidiendo a la puerta su salida (que a su vez necesitará se le proporcione entradas). Por ejemplo:

source: >>> g2 = OrGate("G2") >>> g2.getOutput() Enter Pin A input for gate G2-->1 Enter Pin B input for gate G2-->1 1 >>> g2.getOutput() Enter Pin A input for gate G2-->0 Enter Pin B input for gate G2-->0 0 >>> g3 = NotGate("G3") >>> g3.getOutput() Enter Pin input for gate G3-->0 1
es_419: >>> g2 = CompuertaO("G2") >>> g2.darSalida() Ingrese la entrada para el Pin A de la compuerta G2-->1 Ingrese la entrada para el Pin B de la compuerta G2-->1 1 >>> g2.darSalida() Ingrese la entrada para el Pin A de la compuerta G2-->0 Ingrese la entrada para el Pin B de la compuerta G2-->0 0 >>> g3 = CompuertaNO("G3") >>> g3.darSalida() Ingrese la entrada para el Pin de la compuerta G3-->0 1

source: Now that we have the basic gates working, we can turn our attention to building circuits. In order to create a circuit, we need to connect gates together, the output of one flowing into the input of another. To do this, we will implement a new class called ``Connector``.
es_419: Ahora que tenemos las puertas básicas funcionando, podemos centrar nuestra atención en la construcción de circuitos. Para crear un circuito, necesitamos conectar las compuertas entre sí, la salida de una que fluya a la entrada de otra. Para ello, implementaremos una nueva clase llamada ``Conector``.

source: The ``Connector`` class will not reside in the gate hierarchy. It will, however, use the gate hierarchy in that each connector will have two gates, one on either end (see :ref:`Figure 12 <fig_connector>`). This relationship is very important in object-oriented programming. It is called the **HAS-A Relationship**. Recall earlier that we used the phrase “IS-A Relationship” to say that a child class is related to a parent class, for example ``UnaryGate`` IS-A ``LogicGate``.
es_419: La clase ``Conector`` no residirá en la jerarquía gate. Sin embargo, utilizará la jerarquía de puerta en que cada conector tendrá dos puertas, una en cada extremo (ver :ref:`Figura 12 <fig_connector>`). Esta relación es muy importante en la programación orientada a objetos. Se llama el **Relación HAS-A**. Recuerde primero que usamos la frase "Relación IS-A" para decir que una clase hija está relacionada con una clase padre, por ejemplo ``CompuertaUnaria`` IS-A ``CompuertaLogica``.

source: Figure 12: A Connector Connects the Output of One Gate to the Input of Another
es_419: Figura 12: Un Conector Conecta la Salida de Una Puerta a la Entrada de Otra.

source: Now, with the ``Connector`` class, we say that a ``Connector`` HAS-A ``LogicGate`` meaning that connectors will have instances of the ``LogicGate`` class within them but are not part of the hierarchy. When designing classes, it is very important to distinguish between those that have the IS-A relationship (which requires inheritance) and those that have HAS-A relationships (with no inheritance).
es_419: Ahora, con la clase ``Conector``, decimos que un ``Conector`` tiene un (HAS-A) ``CompuertaLogica``, lo que significa que los conectores tendrán instancias de la clase ``CompuertaLogica`` dentro de ellos pero no forman parte de la jerarquía. Al diseñar clases, es muy importante distinguir entre aquellos que tienen la relación IS-A (que requiere herencia) y aquellos que tienen relaciones HAS-A (sin herencia).

source: :ref:`Listing 12 <lst_Connectorclass>` shows the ``Connector`` class. The two gate instances within each connector object will be referred to as the ``fromgate`` and the ``togate``, recognizing that data values will “flow” from the output of one gate into an input line of the next. The call to ``setNextPin`` is very important for making connections (see :ref:`Listing 13 <lst_setpin>`). We need to add this method to our gate classes so that each ``togate`` can choose the proper input line for the connection.
es_419: :ref:`Listado 12 <lst_Connectorclass>` muestra la clase ``Conector``. Las dos instancias de puerta dentro de cada objeto conector se denominarán ``depuerta`` y ``apuerta``, reconociendo que los valores de datos "fluirán" desde la salida de una puerta a una línea de entrada de la siguiente. La llamada a ``ponerProxPin`` es muy importante para realizar conexiones (ver :ref:`Listado 13 <lst_setpin>`). Necesitamos agregar este método a nuestras clases gate para que cada ``apuerta`` pueda elegir la línea de entrada adecuada para la conexión.

source: class Connector: def __init__(self, fgate, tgate): self.fromgate = fgate self.togate = tgate tgate.setNextPin(self) def getFrom(self): return self.fromgate def getTo(self): return self.togate
es_419: class Conector: def __init__(self, dpuerta, apuerta): self.depuerta = dpuerta self.apuerta = apuerta apuerta.ponerProxPin(self) def darDesde(self): return self.depuerta def darHasta(self): return self.apuerta

source: In the ``BinaryGate`` class, for gates with two possible input lines, the connector must be connected to only one line. If both of them are available, we will choose ``pinA`` by default. If ``pinA`` is already connected, then we will choose ``pinB``. It is not possible to connect to a gate with no available input lines.
es_419: En la clase ``CompuertaBinaria``, para puertas con dos posibles líneas de entrada, el conector debe conectarse a una sola línea. Si ambos están disponibles, elegiremos ``pinA`` de forma predeterminada. Si ``pinA`` ya está conectado, entonces elegiremos ``pinB``. No es posible conectarse a una puerta sin líneas de entrada disponibles.

source: **Listing 13**
es_419: **Listado 13**

source: def setNextPin(self,source): if self.pinA == None: self.pinA = source else: if self.pinB == None: self.pinB = source else: raise RuntimeError("Error: NO EMPTY PINS")
es_419: def ponerProxPin(self, origen): if self.pinA == None: self.pinA = origen else: if self.pinB == None: self.pinB = origen else: raise RuntimeError("Error: SIN PINS VACIOS")

source: Now it is possible to get input from two places: externally, as before, and from the output of a gate that is connected to that input line. This requires a change to the ``getPinA`` and ``getPinB`` methods (see :ref:`Listing 14 <lst_newgetpin>`). If the input line is not connected to anything (``None``), then ask the user externally as before. However, if there is a connection, the connection is accessed and ``fromgate``’s output value is retrieved. This in turn causes that gate to process its logic. This continues until all input is available and the final output value becomes the required input for the gate in question. In a sense, the circuit works backwards to find the input necessary to finally produce output.
es_419: Ahora es posible obtener entradas desde dos lugares: externamente, como antes, y desde la salida de una puerta que está conectada a esa línea de entrada. Esto requiere un cambio en los métodos ``darPinA`` y ``darPinB`` (ver :ref:`Listado 14 <lst_newgetpin>`). Si la línea de entrada no está conectada a nada (``None``), pregunte al usuario externamente como antes. Sin embargo, si hay una conexión, se accede a la conexión y se recupera el valor de salida ``depuerta``. Esto a su vez hace que esa puerta procese su lógica. Esto continúa hasta que todas las entradas estén disponibles y el valor de salida final se convierta en la entrada requerida para la puerta en cuestión. En cierto sentido, el circuito funciona hacia atrás para encontrar la entrada necesaria para finalmente producir salida.

source: **Listing 14**
es_419: **Listado 14**

source: def getPinA(self): if self.pinA == None: return input("Enter Pin A input for gate " + self.getName()+"-->") else: return self.pinA.getFrom().getOutput()
es_419: def darPinA(self): if self.pinA == None: return input("Ingrese una entrada para el Pina A de la puerta " + self.darNombre()+"-->") else: return self.pinA.darOrigen().darSalida()

source: The following fragment constructs the circuit shown earlier in the section:
es_419: El siguiente fragmento construye el circuito mostrado anteriormente en la sección:

source: >>> g1 = AndGate("G1") >>> g2 = AndGate("G2") >>> g3 = OrGate("G3") >>> g4 = NotGate("G4") >>> c1 = Connector(g1,g3) >>> c2 = Connector(g2,g3) >>> c3 = Connector(g3,g4)
es_419: >>> g1 = CompuertaY("G1") >>> g2 = CompuertaY("G2") >>> g3 = CompuertaO("G3") >>> g4 = CompuertaNO("G4") >>> c1 = Conector(g1, g3) >>> c2 = Conector(g2, g3) >>> c3 = Conector(g3, g4)

source: The outputs from the two AND gates (``g1`` and ``g2``) are connected to the OR gate (``g3``) and that output is connected to the NOT gate (``g4``). The output from the NOT gate is the output of the entire circuit. For example:
es_419: Las salidas de las dos puertas AND (``g1`` and ``g2``) están conectadas a la puerta OR (``g3``) y la salida está conectada a la puerta NOT (``g4``). La salida de la puerta NOT es la salida de todo el circuito. Por ejemplo:

source: >>> g4.getOutput() Pin A input for gate G1-->0 Pin B input for gate G1-->1 Pin A input for gate G2-->1 Pin B input for gate G2-->1 0
es_419: >>> g4.darSalida() Entrada Pin A para compuerta G1-->0 Entrada Pin B para compuerta G1-->1 Entrada Pin A para compuerta G2-->1 Entrada Pin B para compuerta G2-->1 0

source: Try it yourself using ActiveCode 4.
es_419: Inténtelo usted mismo utilizando ActiveCode 4.

source: data-caption='The Complete Circuit Program.'
es_419: data-caption='El Programa Circuito Completo.'

source: class LogicGate: def __init__(self,n): self.name = n self.output = None def getName(self): return self.name def getOutput(self): self.output = self.performGateLogic() return self.output class BinaryGate(LogicGate): def __init__(self,n): LogicGate.__init__(self,n) self.pinA = None self.pinB = None def getPinA(self): if self.pinA == None: return int(input("Enter Pin A input for gate "+self.getName()+"-->")) else: return self.pinA.getFrom().getOutput() def getPinB(self): if self.pinB == None: return int(input("Enter Pin B input for gate "+self.getName()+"-->")) else: return self.pinB.getFrom().getOutput() def setNextPin(self,source): if self.pinA == None: self.pinA = source else: if self.pinB == None: self.pinB = source else: print("Cannot Connect: NO EMPTY PINS on this gate") class AndGate(BinaryGate): def __init__(self,n): BinaryGate.__init__(self,n) def performGateLogic(self): a = self.getPinA() b = self.getPinB() if a==1 and b==1: return 1 else: return 0 class OrGate(BinaryGate): def __init__(self,n): BinaryGate.__init__(self,n) def performGateLogic(self): a = self.getPinA() b = self.getPinB() if a ==1 or b==1: return 1 else: return 0 class UnaryGate(LogicGate): def __init__(self,n): LogicGate.__init__(self,n) self.pin = None def getPin(self): if self.pin == None: return int(input("Enter Pin input for gate "+self.getName()+"-->")) else: return self.pin.getFrom().getOutput() def setNextPin(self,source): if self.pin == None: self.pin = source else: print("Cannot Connect: NO EMPTY PINS on this gate") class NotGate(UnaryGate): def __init__(self,n): UnaryGate.__init__(self,n) def performGateLogic(self): if self.getPin(): return 0 else: return 1 class Connector: def __init__(self, fgate, tgate): self.fromgate = fgate self.togate = tgate tgate.setNextPin(self) def getFrom(self): return self.fromgate def getTo(self): return self.togate def main(): g1 = AndGate("G1") g2 = AndGate("G2") g3 = OrGate("G3") g4 = NotGate("G4") c1 = Connector(g1,g3) c2 = Connector(g2,g3) c3 = Connector(g3,g4) print(g4.getOutput()) main()
es_419: class CompuertaLogica: def __init__(self,n): self.etiqueta = n self.salida = None def darEtiqueta(self): return self.etiqueta def darSalida(self): self.salida = self.realizarCompuertaLogica() return self.salida class CompuertaBinaria(CompuertaLogica): def __init__(self,n): CompuertaLogica.__init__(self,n) self.pinA = None self.pinB = None def darPinA(self): if self.pinA == None: return int(input("Ingrese la entrada para el Pin A de la compuerta "+ self.darEtiqueta()+"-->")) else: return self.pinA.darOrigen().darSalida() def darPinB(self): if self.pinB == None: return int(input("Ingrese la entrada para el Pin B de la compuerta "+ self.darEtiqueta()+"-->")) else: return self.pinA.darOrigen().darSalida() def ponerProxPin(self, origen): if self.pinA == None: self.pinA = origen else: if self.pinB == None: self.pinB = origen else: raise RuntimeError("Error: SIN PINS VACIOS") class CompuertaY(CompuertaBinaria): def __init__(self,n): CompuertaBinaria.__init__(self, n) def realizarCompuertaLogica(self): a = self.darPinA() b = self.darPinB() if a==1 and b==1: return 1 else: return 0 class CompuertaO(CompuertaBinaria): def __init__(self,n): CompuertaBinaria.__init__(self, n) def realizarCompuertaLogica(self): a = self.darPinA() b = self.darPinB() if a==1 or b==1: return 1 else: return 0 class CompuertaUnaria(CompuertaLogica): def __init__(self,n): CompuertaLogica.__init__(self,n) self.pin = None def darPin(self): if self.pin == None: return int(input("Ingrese la entrada para el Pin de la compuerta "+ self.darEtiqueta()+"-->")) else: return self.pin.darOrigen().darSalida() def ponerProxPin(self, origen): if self.pin == None: self.pin = origen else: raise RuntimeError("Error: SIN PINS VACIOS") class CompuertaNO(CompuertaUnaria): def __init__(self, n): CompuertaUnaria.__init__(self, n) def realizarCompuertaLogica(self): if self.darPin(): return 0 else: return 1 class Conector: def __init__(self, dpuerta, apuerta): self.depuerta = dpuerta self.apuerta = apuerta apuerta.ponerProxPin(self) def darOrigen(self): return self.depuerta def darDestino(self): return self.apuerta def principal(): g1 = CompuertaY("G1") g2 = CompuertaY("G2") g3 = CompuertaO("G3") g4 = CompuertaNO("G4") c1 = Conector(g1, g3) c2 = Conector(g2, g3) c3 = Conector(g3, g4) print(g4.darSalida()) principal()

source: Self Check
es_419: Auto-Evaluación

source: Create a two new gate classes, one called NorGate the other called NandGate. NandGates work like AndGates that have a Not attached to the output. NorGates work lake OrGates that have a Not attached to the output.
es_419: Cree dos nuevas clases de puertas, una llamada NorGate y otra llamada NandGate. NandGates funcionan como AndGates con un Not conectado a la salida. Los NorGates trabajan como OrGates con un Not conectado a la salida.

source: Create a series of gates that prove the following equality NOT (( A and B) or (C and D)) is that same as NOT( A and B ) and NOT (C and D). Make sure to use some of your new gates in the simulation.
es_419: Crear una serie de puertas que demuestren la siguiente igualdad NOT ((A and B) or (C and D)) es lo mismo que NOT (A and B) and NOT (C and D). Asegúrese de usar algunas de sus puertas nuevas en la simulación.
