Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/ObjectOrientedProgramminginPythonDefiningClasses.po
Languages: es_419

source: Object-Oriented Programming in Python: Defining Classes
es_419: Programación Orientada a Objetos en Python: Definiendo Clases.

source: We stated earlier that Python is an object-oriented programming language. So far, we have used a number of built-in classes to show examples of data and control structures. One of the most powerful features in an object-oriented programming language is the ability to allow a programmer (problem solver) to create new classes that model data that is needed to solve the problem.
es_419: Hemos dicho anteriormente que Python es un lenguaje de programación orientado a objetos. Hasta ahora, hemos utilizado una serie de clases integradas para mostrar ejemplos de datos y estructuras de control. Una de las características más poderosas en un lenguaje de programación orientado a objetos es la capacidad de permitir a un programador (solucionador de problemas) crear nuevas clases que modelen los datos necesarios para resolver el problema.

source: Remember that we use abstract data types to provide the logical description of what a data object looks like (its state) and what it can do (its methods). By building a class that implements an abstract data type, a programmer can take advantage of the abstraction process and at the same time provide the details necessary to actually use the abstraction in a program. Whenever we want to implement an abstract data type, we will do so with a new class.
es_419: Recuerde que usamos tipos de datos abstractos para proporcionar la descripción lógica de cómo se ve un objeto de datos (su estado) y lo qué puede hacer (sus métodos). Mediante la construcción de una clase que implementa un tipo de datos abstractos, un programador puede aprovechar del proceso de abstracción y al mismo tiempo proporcionar los detalles necesarios para utilizar realmente la abstracción en un programa. Siempre que deseemos implementar un tipo de datos abstractos, lo haremos con una nueva clase.

source: A ``Fraction`` Class
es_419: Una Clase ``Fraccion``

source: A very common example to show the details of implementing a user-defined class is to construct a class to implement the abstract data type ``Fraction``. We have already seen that Python provides a number of numeric classes for our use. There are times, however, that it would be most appropriate to be able to create data objects that “look like” fractions.
es_419: Un ejemplo muy común para mostrar los detalles de la implementación de una clase definida por el usuario es construir una clase para implementar el tipo de datos abstracto ``Fraccion``. Ya hemos visto que Python proporciona una serie de clases numéricas para nuestro uso. Hay veces, sin embargo, que sería más apropiado ser capaz de crear objetos de datos que "parecen" fracciones.

source: A fraction such as :math:`\frac {3}{5}` consists of two parts. The top value, known as the numerator, can be any integer. The bottom value, called the denominator, can be any integer greater than 0 (negative fractions have a negative numerator). Although it is possible to create a floating point approximation for any fraction, in this case we would like to represent the fraction as an exact value.
es_419: Una fracción como :math: `\ frac {3} {5}` consiste de dos partes. El valor superior, conocido como el numerador, puede ser cualquier entero. El valor inferior, denominado el denominador, puede ser cualquier entero mayor que 0 (las fracciones negativas tienen un numerador negativo). Aunque es posible crear una aproximación de punto flotante para cualquier fracción, en este caso nos gustaría representar la fracción como un valor exacto.

source: The operations for the ``Fraction`` type will allow a ``Fraction`` data object to behave like any other numeric value. We need to be able to add, subtract, multiply, and divide fractions. We also want to be able to show fractions using the standard “slash” form, for example 3/5. In addition, all fraction methods should return results in their lowest terms so that no matter what computation is performed, we always end up with the most common form.
es_419: Las operaciones para el tipo ``Fraccion`` permitirán que un objeto de datos ``Fraccion`` se comporte como cualquier otro valor numérico. Necesitamos ser capaces de sumar, restar, multiplicar y dividir fracciones. También queremos ser capaces de mostrar fracciones usando la forma estándar de "barra", por ejemplo 3/5. Además, todos los métodos de fracciones deben devolver resultados en sus términos más bajos de modo que no importa qué computación sea realizada, siempre terminamos con la forma más común.

source: In Python, we define a new class by providing a name and a set of method definitions that are syntactically similar to function definitions. For this example,
es_419: En Python, definimos una nueva clase proporcionando un nombre y un conjunto de definiciones de método que son sintácticamente similares a las definiciones de funciones. Para este ejemplo,

source: class Fraction: #the methods go here
es_419: class Fraccion: #los métodos vienen aquí

source: provides the framework for us to define the methods. The first method that all classes should provide is the constructor. The constructor defines the way in which data objects are created. To create a ``Fraction`` object, we will need to provide two pieces of data, the numerator and the denominator. In Python, the constructor method is always called __init__ (two underscores before and after ``init``) and is shown in :ref:`Listing 2 <lst_pyconstructor>`.
es_419: Proporciona el marco para definir los métodos. El primer método que todas las clases deben proporcionar es el constructor. El constructor define la forma en que se crean los objetos de datos. Para crear un objeto ``Fraccion``, tendremos que proporcionar dos datos, el numerador y el denominador. En Python, el método constructor siempre se llama __init__ (dos subrayados antes y después de ``init``) y se muestra en :ref:`Listado 2 <lst_pyconstructor>`.

source: **Listing 2**
es_419: **Listado 2**

source: class Fraction: def __init__(self,top,bottom): self.num = top self.den = bottom
es_419: class Fraccion: def __init__(self, arriba, abajo): self.num = arriba self.den = abajo

source: Notice that the formal parameter list contains three items (``self``, ``top``, ``bottom``). ``self`` is a special parameter that will always be used as a reference back to the object itself. It must always be the first formal parameter; however, it will never be given an actual parameter value upon invocation. As described earlier, fractions require two pieces of state data, the numerator and the denominator. The notation ``self.num`` in the constructor defines the ``fraction`` object to have an internal data object called ``num`` as part of its state. Likewise, ``self.den`` creates the denominator. The values of the two formal parameters are initially assigned to the state, allowing the new ``fraction`` object to know its starting value.
es_419: Observe que la lista de parámetros formales contiene tres elementos (``self``, ``arriba``, ``abajo``). ``self`` es un parámetro especial que siempre utilizaremos como referencia al objeto mismo. Debe ser siempre el primer parámetro formal; sin embargo, nunca se le dará un valor de parámetro real en la invocación. Como se describió anteriormente, las fracciones requieren dos partes de los datos de estado, el numerador y el denominador. La notación ``self.num`` en el constructor define el objeto ``fraccion`` para tener un objeto de datos interno llamado ``num`` como parte de su estado. Del mismo modo, ``self.den`` crea el denominador. Los valores de los dos parámetros formales se asignan inicialmente al estado, permitiendo que el nuevo objeto ``fraccion`` conozca su valor inicial.

source: To create an instance of the ``Fraction`` class, we must invoke the constructor. This happens by using the name of the class and passing actual values for the necessary state (note that we never directly ``invoke __init__``). For example,
es_419: Para crear una instancia de la clase ``Fraccion``, debemos invocar al constructor. Esto ocurre usando el nombre de la clase y pasando los valores reales para el estado necesario (tenga en cuenta que nunca directamente invocamos ``__init__``). Por ejemplo,

source: myfraction = Fraction(3,5)
es_419: mifraccion = Fraccion(3, 5)

source: creates an object called ``myfraction`` representing the fraction :math:`\frac {3}{5}` (three-fifths). :ref:`Figure 5 <fig_fraction1>` shows this object as it is now implemented.
es_419: Cree un objeto llamado ``mifraccion`` que representa la fracción :math: `\frac {3}{5}` (tres quintos). :ref:`Figura 5 <fig_fraction1>` muestra este objeto tal como está ahora implementado.

source: Figure 5: An Instance of the ``Fraction`` Class
es_419: Figura 5: Una Instancia de la Clase ``Fraccion``

source: The next thing we need to do is implement the behavior that the abstract data type requires. To begin, consider what happens when we try to print a ``Fraction`` object.
es_419: Lo siguiente que debemos hacer es implementar el comportamiento que requiere el tipo de datos abstracto. Para comenzar, considere lo que sucede cuando tratamos de imprimir un objeto ``Fraccion``.

source: >>> myf = Fraction(3,5) >>> print(myf) <__main__.Fraction instance at 0x409b1acc>
es_419: >>> mif = Fraccion(3,5) >>> print(mif) <__main__.Fraccion instance at 0x409b1acc>

source: The ``fraction`` object, ``myf``, does not know how to respond to this request to print. The ``print`` function requires that the object convert itself into a string so that the string can be written to the output. The only choice ``myf`` has is to show the actual reference that is stored in the variable (the address itself). This is not what we want.
es_419: El objeto ``fraccion``, ``mif``, no sabe cómo responder a esta solicitud de impresión. La función ``print`` requiere que el objeto se convierta en una cadena para que la cadena se pueda escribir en la salida. La única opción que ``mif`` tiene es mostrar la referencia real que se almacena en la variable (la propia dirección). Esto no es lo que queremos.

source: There are two ways we can solve this problem. One is to define a method called ``show`` that will allow the ``Fraction`` object to print itself as a string. We can implement this method as shown in :ref:`Listing 3 <lst_showmethod>`. If we create a ``Fraction`` object as before, we can ask it to show itself, in other words, print itself in the proper format. Unfortunately, this does not work in general. In order to make printing work properly, we need to tell the ``Fraction`` class how to convert itself into a string. This is what the ``print`` function needs in order to do its job.
es_419: Hay dos maneras de resolver este problema. Uno de ellos es definir un método llamado ``mostrar`` que permitirá que el objeto ``Fraccion`` se imprima como una cadena. Podemos implementar este método como se muestra en :ref:`Listado 3 <lst_showmethod>`. Si creamos un objeto ``Fraccion`` como antes, podemos pedir que se muestre, en otras palabras, se imprima en el formato apropiado. Desafortunadamente, esto no funciona en general. Para que la impresión funcione correctamente, necesitamos decirle a la clase ``Fraccion`` cómo convertirse en una cadena. Esto es lo que necesita la función ``print`` para hacer su trabajo.

source: **Listing 3**
es_419: **Listado 3**

source: def show(self): print(self.num,"/",self.den)
es_419: def mostrar(self): print(self.num, "/", self.den)

source: >>> myf = Fraction(3,5) >>> myf.show() 3 / 5 >>> print(myf) <__main__.Fraction instance at 0x40bce9ac> >>>
es_419: >>> mif = Fraccion(3, 5) >>> mif.mostrar() 3 / 5 >>> print(mif) <__main__.Fraccion instance at 0x40bce9ac> >>>

source: In Python, all classes have a set of standard methods that are provided but may not work properly. One of these, ``__str__``, is the method to convert an object into a string. The default implementation for this method is to return the instance address string as we have already seen. What we need to do is provide a “better” implementation for this method. We will say that this implementation **overrides** the previous one, or that it redefines the method’s behavior.
es_419: En Python, todas las clases tienen un conjunto de métodos estándar que vienen incluidos pero pueden no funcionar correctamente. Uno de estos, ``__str__``, es el método para convertir un objeto en una cadena. La implementación predeterminada para este método es devolver la cadena de direcciones de instancia que ya hemos visto. Lo que necesitamos hacer es proporcionar una implementación "mejor" para este método. Diremos que esta implementación **anula** la anterior, o que redefine el comportamiento del método.

source: To do this, we simply define a method with the name ``__str__`` and give it a new implementation as shown in :ref:`Listing 4 <lst_str>`. This definition does not need any other information except the special parameter ``self``. In turn, the method will build a string representation by converting each piece of internal state data to a string and then placing a ``/`` character in between the strings using string concatenation. The resulting string will be returned any time a ``Fraction`` object is asked to convert itself to a string. Notice the various ways that this function is used.
es_419: Para ello, simplemente definimos un método con el nombre ``__str__`` y le damos una nueva implementación como se muestra en :ref:`Listado 4 <lst_str>`. Esta definición no necesita ninguna otra información excepto el parámetro especial ``self``. A su vez, el método construirá una representación de cadena convirtiendo cada pieza de datos de estado interno en una cadena y luego colocando un carácter ``/ `` entre las cadenas usando la concatenación de cadenas. La cadena resultante se devolverá cada vez que se solicite a un objeto ``Fraccion`` que se convierta en una cadena. Observe las diversas formas en que se utiliza esta función.

source: **Listing 4**
es_419: **Listado 4**

source: >>> myf = Fraction(3,5) >>> print(myf) 3/5 >>> print("I ate", myf, "of the pizza") I ate 3/5 of the pizza >>> myf.__str__() '3/5' >>> str(myf) '3/5' >>>
es_419: >>> mif = Fraccion(3, 5) >>> print(mif) 3/5 >>> print("Yo comí", mif, "de la pizza") Yo comí 3/5 de la pizza >>> mif.__str__() '3/5' >>> str(mif) '3/5' >>>

source: We can override many other methods for our new ``Fraction`` class. Some of the most important of these are the basic arithmetic operations. We would like to be able to create two ``Fraction`` objects and then add them together using the standard “+” notation. At this point, if we try to add two fractions, we get the following:
es_419: Podemos anular muchos otros métodos para nuestra nueva clase ``Fraccion``. Algunas de las más importantes son las operaciones aritméticas básicas. Nos gustaría poder crear dos objetos ``Fraccion`` y luego agregarlos juntos usando la notación estándar "+" . En este punto, si intentamos agregar dos fracciones, obtendremos lo siguiente:

source: >>> f1 = Fraction(1,4) >>> f2 = Fraction(1,2) >>> f1+f2 Traceback (most recent call last): File "<pyshell#173>", line 1, in -toplevel- f1+f2 TypeError: unsupported operand type(s) for +: 'instance' and 'instance' >>>
es_419: >>> f1 = Fraccion(1,4) >>> f2 = Fraccion(1,2) >>> f1+f2 Traceback (most recent call last): File "<pyshell#173>", line 1, in -toplevel- f1+f2 TypeError: unsupported operand type(s) for +: 'instance' and 'instance' >>>

source: If you look closely at the error, you see that the problem is that the “+” operator does not understand the ``Fraction`` operands.
es_419: Si observa atentamente el error, verás que el problema es que el operador "+" no entiende los operandos ``Fraccion``.

source: We can fix this by providing the ``Fraction`` class with a method that overrides the addition method. In Python, this method is called ``__add__`` and it requires two parameters. The first, ``self``, is always needed, and the second represents the other operand in the expression. For example,
es_419: Podemos arreglar esto proporcionando la clase ``Fraccion`` con un método que anula el método de adición. En Python, este método se llama ``__add__`` y requiere dos parámetros. El primero, ``self``, siempre es necesario, y el segundo representa el otro operando en la expresión. Por ejemplo,

source: would ask the ``Fraction`` object ``f1`` to add the ``Fraction`` object ``f2`` to itself. This can be written in the standard notation, ``f1+f2``.
es_419: pedirá al objeto``Fraccion`` ``f1`` agregar el objeto ``Fraccion`` ``f2`` a si mismo. Esto puede ser escrito con la notación estándar, ``f1+f2``.

source: Two fractions must have the same denominator to be added. The easiest way to make sure they have the same denominator is to simply use the product of the two denominators as a common denominator so that :math:`\frac {a}{b} + \frac {c}{d} = \frac {ad}{bd} + \frac {cb}{bd} = \frac{ad+cb}{bd}` The implementation is shown in :ref:`Listing 5 <lst_addmethod>`. The addition function returns a new ``Fraction`` object with the numerator and denominator of the sum. We can use this method by writing a standard arithmetic expression involving fractions, assigning the result of the addition, and then printing our result.
es_419: Dos fracciones deben tener el mismo denominador a ser añadido. La forma más fácil de asegurarse de que tienen el mismo denominador es simplemente utilizar el producto de los dos denominadores como un denominador común de modo que :math:`\ frac {a} {b} + \frac {c}{d} = \frac {ad}{bd} + \frac {cb}{bd} = \frac{ad+cb}{bd}` La implementación se muestra en :ref:`Listado 5 <lst_addmethod>`. La función de adición devuelve un nuevo objeto ``Fraccion`` con el numerador y el denominador de la suma. Podemos usar este método escribiendo una expresión aritmética estándar que involucre fracciones, asignando el resultado de la adición e imprimiendo nuestro resultado.

source: **Listing 5**
es_419: **Listado 5**

source: def __add__(self,otherfraction): newnum = self.num*otherfraction.den + self.den*otherfraction.num newden = self.den * otherfraction.den return Fraction(newnum,newden)
es_419: def __add__(self, otrafraccion): nuevonum = self.num * otrafraccion.den + self.den * otrafraccion.num nuevonum = self.den * otrafraccion.den return Fraccion(nuevonum, nuevonum)

source: >>> f1=Fraction(1,4) >>> f2=Fraction(1,2) >>> f3=f1+f2 >>> print(f3) 6/8 >>>
es_419: >>> f1=Fraccion(1, 4) >>> f2=Fraccion(1, 2) >>> f3=f1 + f2 >>> print(f3) 6/8 >>>

source: The addition method works as we desire, but one thing could be better. Note that :math:`6/8` is the correct result (:math:`\frac {1}{4} + \frac {1}{2}`) but that it is not in the “lowest terms” representation. The best representation would be :math:`3/4`. In order to be sure that our results are always in the lowest terms, we need a helper function that knows how to reduce fractions. This function will need to look for the greatest common divisor, or GCD. We can then divide the numerator and the denominator by the GCD and the result will be reduced to lowest terms.
es_419: El método de la adición funciona como deseamos, pero una cosa podría estar mejor. Tenga en cuenta que :math:`6/8` es el resultado correcto (:math:`\frac {1}{4} + \frac {1}{2}`), pero que no está en la representación de "los términos más bajos (lowest terms)". La mejor representación sería :math:`3/4`. Con el fin de estar seguros de que nuestros resultados están siempre en los términos más bajos, necesitamos una función auxiliar que sepa cómo reducir las fracciones. Esta función tendrá que buscar el Máximo Común Divisor (MCD, GCD son sus siglas en inglés). Podemos entonces dividir el numerador y el denominador por el MCD y el resultado se reducirá a los términos más bajos.

source: The best-known algorithm for finding a greatest common divisor is Euclid’s Algorithm, which will be discussed in detail in Chapter 8. Euclid’s Algorithm states that the greatest common divisor of two integers :math:`m` and :math:`n` is :math:`n` if :math:`n` divides :math:`m` evenly. However, if :math:`n` does not divide :math:`m` evenly, then the answer is the greatest common divisor of :math:`n` and the remainder of :math:`m` divided by :math:`n`. We will simply provide an iterative implementation here (see :ref:`ActiveCode 1 <lst_gcd>`). Note that this implementation of the GCD algorithm only works when the denominator is positive. This is acceptable for our fraction class because we have said that a negative fraction will be represented by a negative numerator.
es_419: El algoritmo más conocido para encontrar un mayor divisor común es el Algoritmo de Euclides, el cual será discutido en detalle en el Capítulo 8. El Algoritmo de Euclides establece que el mayor divisor común de dos enteros :math:`m` y :math:`n`es :math:`n` si :math:`n` divide :math:`m` uniformemente. Sin embargo, si :math:`n` no divide :math:`m` uniformemente, entonces la respuesta es el mayor divisor común de :math:`n` y el resto de :math:`m` dividido por :math:`n`. Simplemente proporcionaremos una implementación iterativa aquí (ver :ref:`ActiveCode 1 <lst_gcd>`). Tenga en cuenta que esta implementación del algoritmo MCD sólo funciona cuando el denominador es positivo. Esto es aceptable para nuestra clase de fracciones porque hemos dicho que una fracción negativa estará representada por un numerador negativo.

source: data-caption='The Greatest Common Divisor Function'
es_419: data-caption='La Función Máximo Común Divisor'

source: def gcd(m,n): while m%n != 0: oldm = m oldn = n m = oldn n = oldm%oldn return n print(gcd(20,10))
es_419: def mcd(m,n): while m % n != 0: viejom = m viejon = n m = viejon n = viejom % viejon return n print(mcd(20,10))

source: Now we can use this function to help reduce any fraction. To put a fraction in lowest terms, we will divide the numerator and the denominator by their greatest common divisor. So, for the fraction :math:`6/8`, the greatest common divisor is 2. Dividing the top and the bottom by 2 creates a new fraction, :math:`3/4` (see :ref:`Listing 6 <lst_newaddmethod>`).
es_419: Ahora podemos utilizar esta función para ayudar a reducir cualquier fracción. Para poner una fracción en los términos más bajos, dividiremos el numerador y el denominador por su máximo divisor común. Por lo tanto, para la fracción :math:`6/8`, el mayor divisor común es 2. Dividiendo la parte superior e inferior para 2 crea una nueva fracción, :math:`3/4` (ver :ref:`Listado 6 <lst_newaddmethod>`).

source: **Listing 6**
es_419: **Listado 6**

source: def __add__(self,otherfraction): newnum = self.num*otherfraction.den + self.den*otherfraction.num newden = self.den * otherfraction.den common = gcd(newnum,newden) return Fraction(newnum//common,newden//common)
es_419: def __add__(self, otrafraccion): nuevonum = self.num * otrafraccion.den + self.den * otrafraccion.num nuevoden = self.den * otrafraccion.den comun = mcd(nuevonum, nuevoden) return Fraccion(nuevonum//comun, nuevoden//comun)

source: >>> f1=Fraction(1,4) >>> f2=Fraction(1,2) >>> f3=f1+f2 >>> print(f3) 3/4 >>>
es_419: >>> f1=Fraccion(1, 4) >>> f2=Fraccion(1, 2) >>> f3=f1 + f2 >>> print(f3) 3/4 >>>

source: Figure 6: An Instance of the ``Fraction`` Class with Two Methods
es_419: Figura 6: Una Instancia de la Clase ``Fraccion`` con Dos Métodos
