Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/ObjectOrientedProgramminginPythonDefiningClasses.po
Languages: es_419

source: Our ``Fraction`` object now has two very useful methods and looks like :ref:`Figure 6 <fig_fraction2>`. An additional group of methods that we need to include in our example ``Fraction`` class will allow two fractions to compare themselves to one another. Assume we have two ``Fraction`` objects, ``f1`` and ``f2``. ``f1==f2`` will only be ``True`` if they are references to the same object. Two different objects with the same numerators and denominators would not be equal under this implementation. This is called **shallow equality** (see :ref:`Figure 7 <fig_fraction3>`).
es_419: Nuestro objeto ``Fraccion`` ahora tiene dos métodos muy útiles y se parece a :ref:`Figura 6 <fig_fraction2>`. Un grupo adicional de métodos que debemos incluir en nuestra clase de ejemplo ``Fraccion`` permitirá que dos fracciones se comparen entre sí. Supongamos que tenemos dos objetos ``Fraccion``, ` f1`` y ``f2``. `` f1 == f2`` solo será ``True`` si son referencias al mismo objeto. Dos objetos diferentes con los mismos numeradores y denominadores no serían iguales en esta implementación. Esto se denomina **igualdad superficial (shallow equality)** (ver :ref:`Figura 7 <fig_fraction3>`).

source: Figure 7: Shallow Equality Versus Deep Equality
es_419: Figura 7: Igualdad Superficial (Shallow Equality) vs Igualdad Profunda (Deep Equality)

source: We can create **deep equality** (see :ref:`Figure 7 <fig_fraction3>`)–equality by the same value, not the same reference–by overriding the ``__eq__`` method. The ``__eq__`` method is another standard method available in any class. The ``__eq__`` method compares two objects and returns ``True`` if their values are the same, ``False`` otherwise.
es_419: Podemos crear **Igualdad profunda (deep equality)** (ver :ref:`Figura 7 <fig_fraction3>`)–La igualdad por el mismo valor, no la misma referencia–sobrescribiendo el método ``__eq__``. El método ``__eq__`` es otro de los métodos estándar disponible en cualquier clase. El método ``__eq__`` compara dos objetos y devuelve ``True`` si sus valores son los mismos, caso contrario devuelve ``False``.

source: In the ``Fraction`` class, we can implement the ``__eq__`` method by again putting the two fractions in common terms and then comparing the numerators (see :ref:`Listing 7 <lst_cmpmethod>`). It is important to note that there are other relational operators that can be overridden. For example, the ``__le__`` method provides the less than or equal functionality.
es_419: En la clase ``Fraccion``, podemos implementar el método ``__eq__`` poniendo de nuevo las dos fracciones en términos comunes y luego comparando los numeradores (ver :ref:`Listing 7 <lst_cmpmethod>`). Es importante tener en cuenta que hay otros operadores relacionales que pueden ser anulados o sobrescritos. Por ejemplo, el método ``__le__`` proporciona la funcionalidad "menor o igual".

source: **Listing 7**
es_419: **Listado 7**

source: def __eq__(self, other): firstnum = self.num * other.den secondnum = other.num * self.den return firstnum == secondnum
es_419: def __eq__(self, otro): primernum = self.num * otro.den segundonum = otro.num * self.den return primernum == segundonum

source: The complete ``Fraction`` class, up to this point, is shown in :ref:`ActiveCode 2 <lst_fractioncode>`. We leave the remaining arithmetic and relational methods as exercises.
es_419: La clase completa ``Fraccion``, hasta este punto, se muestra en :ref:`ActiveCode 2 <lst_fractioncode>`. Dejamos los restantes métodos aritméticos y relacionales como ejercicios.

source: data-caption='The Fraction Class'
es_419: data-caption='La Clase Fraccion'

source: def gcd(m,n): while m%n != 0: oldm = m oldn = n m = oldn n = oldm%oldn return n class Fraction: def __init__(self,top,bottom): self.num = top self.den = bottom def __str__(self): return str(self.num)+"/"+str(self.den) def show(self): print(self.num,"/",self.den) def __add__(self,otherfraction): newnum = self.num*otherfraction.den + \ self.den*otherfraction.num newden = self.den * otherfraction.den common = gcd(newnum,newden) return Fraction(newnum//common,newden//common) def __eq__(self, other): firstnum = self.num * other.den secondnum = other.num * self.den return firstnum == secondnum x = Fraction(1,2) y = Fraction(2,3) print(x+y) print(x == y)
es_419: def mcd(m,n): while m%n != 0: viejom = m viejon = n m = viejon n = viejom % viejon return n class Fraccion: def __init__(self, arriba, abajo): self.num = arriba self.den = abajo def __str__(self): return str(self.num) + "/" + str(self.den) def mostrar(self): print(self.num, "/", self.den) def __add__(self, otrafraccion): nuevonum = self.num*otrafraccion.den + \ self.den*otrafraccion.num nuevoden = self.den * otrafraccion.den comun = gcd(nuevonum,newden) return Fraction(nuevonum//comun, nuevoden//comun) def __eq__(self, other): primernum = self.num * other.den segundonum = other.num * self.den return primernum == segundonum x = Fraccion(1, 2) y = Fraccion(2, 3) print(x + y) print(x == y)

source: Self Check
es_419: Auto-Evaluación

source: To make sure you understand how operators are implemented in Python classes, and how to properly write methods, write some methods to implement ``*, /,`` and ``-`` . Also implement comparison operators > and <
es_419: Para asegurarse de que comprenda cómo se implementan los operadores en las clases de Python y cómo escribir correctamente los métodos, escriba algunos métodos para implementar ``*, /, `` y `` -``. También implemente los operadores de comparación > y <

source: Inheritance: Logic Gates and Circuits
es_419: Herencia: Compuertas Lógicas y Circuitos

source: Our final section will introduce another important aspect of object-oriented programming. **Inheritance** is the ability for one class to be related to another class in much the same way that people can be related to one another. Children inherit characteristics from their parents. Similarly, Python child classes can inherit characteristic data and behavior from a parent class. These classes are often referred to as **subclasses** and **superclasses**.
es_419: Nuestra sección final presentará otro aspecto importante de la programación orientada a objetos. **La herencia** es la habilidad para que una clase esté relacionada con otra clase de la misma manera que las personas pueden estar relacionadas entre sí. Los niños heredan características de sus padres. Del mismo modo, las clases hijas de Python pueden heredar datos y comportamiento característicos de una clase padre. Estas clases se denominan a menudo **subclases** y **superclases**.

source: :ref:`Figure 8 <fig_inherit1>` shows the built-in Python collections and their relationships to one another. We call a relationship structure such as this an **inheritance hierarchy**. For example, the list is a child of the sequential collection. In this case, we call the list the child and the sequence the parent (or subclass list and superclass sequence). This is often referred to as an ``IS-A Relationship`` (the list **IS-A** sequential collection). This implies that lists inherit important characteristics from sequences, namely the ordering of the underlying data and operations such as concatenation, repetition, and indexing.
es_419: :ref:`Figura 8 <fig_inherit1>` muestra las colecciones integradas de Python y sus relaciones entre sí. Llamamos a una estructura de relación como ésta una **jerarquía de herencia**. Por ejemplo, la lista es un hijo de la colección secuencial. En este caso, llamamos a la lista el hijo y la secuencia el padre (o la subclase lista y la superclase secuencia). A menudo se denomina ``IS-A Relationship`` (la lista **IS-A** colección secuencial). Esto implica que las listas heredan características importantes de las secuencias, a saber, el ordenamiento de los datos y las operaciones subyacentes, tales como la concatenación, la repetición y la indexación.

source: Figure 8: An Inheritance Hierarchy for Python Collections
es_419: Figura 8: Una Jerarquía de Herencia para Colecciones Python

source: Lists, tuples, and strings are all types of sequential collections. They all inherit common data organization and operations. However, each of them is distinct based on whether the data is homogeneous and whether the collection is immutable. The children all gain from their parents but distinguish themselves by adding additional characteristics.
es_419: Las listas, tuplas y cadenas son todas tipo de colecciones secuenciales. Todos heredan organización y operaciones comunes de datos. Sin embargo, cada una de ellas es distinta según si los datos son homogéneos y si la colección es inmutable. Los hijos ganan de sus padres pero se distinguen agregando características adicionales.

source: By organizing classes in this hierarchical fashion, object-oriented programming languages allow previously written code to be extended to meet the needs of a new situation. In addition, by organizing data in this hierarchical manner, we can better understand the relationships that exist. We can be more efficient in building our abstract representations.
es_419: Al organizar las clases de esta manera jerárquica, los lenguajes de programación orientados a objetos permiten que el código previamente escrito se extienda para satisfacer las necesidades de una nueva situación. Además, al organizar los datos de esta manera jerárquica, podemos comprender mejor las relaciones que existen. Podemos ser más eficientes en la construcción de nuestras representaciones abstractas.

source: To explore this idea further, we will construct a **simulation**, an application to simulate digital circuits. The basic building block for this simulation will be the logic gate. These electronic switches represent boolean algebra relationships between their input and their output. In general, gates have a single output line. The value of the output is dependent on the values given on the input lines.
es_419: Para explorar esta idea, construiremos una **simulación**, una aplicación para simular circuitos digitales. El bloque de construcción básico para esta simulación será la puerta lógica. Estos conmutadores electrónicos representan relaciones de álgebra booleana entre su entrada y su salida. En general, las puertas tienen una sola línea de salida. El valor de la salida depende de los valores dados en las líneas de entrada.

source: AND gates have two input lines, each of which can be either 0 or 1 (representing ``False`` or ``True``, repectively). If both of the input lines have the value 1, the resulting output is 1. However, if either or both of the input lines is 0, the result is 0. OR gates also have two input lines and produce a 1 if one or both of the input values is a 1. In the case where both input lines are 0, the result is 0.
es_419: Las puertas AND tienen dos líneas de entrada, cada una de las cuales puede ser 0 o 1 (representando ``False`` o ``True``, respectivamente). Si ambas líneas de entrada tienen el valor 1, la salida resultante es 1. Sin embargo, si una o ambas líneas de entrada son 0, el resultado es 0. Las puertas OR también tienen dos líneas de entrada y producen un 1 si uno o ambos de los valores de entrada es 1. En el caso en que ambas líneas de entrada sean 0, el resultado será 0.

source: NOT gates differ from the other two gates in that they only have a single input line. The output value is simply the opposite of the input value. If 0 appears on the input, 1 is produced on the output. Similarly, 1 produces 0. :ref:`Figure 9 <fig_truthtable>` shows how each of these gates is typically represented. Each gate also has a **truth table** of values showing the input-to-output mapping that is performed by the gate.
es_419: Las puertas NOT se diferencian de las otras dos puertas porque sólo tienen una sola línea de entrada. El valor de salida es simplemente el opuesto al valor de entrada. Si aparece 0 en la entrada, se produce 1 en la salida. Similarmente, 1 produce 0. :ref:`Figura 9 <fig_truthtable>` muestra cómo cada una de estas puertas típicamente se representa. Cada puerta también tiene una **tabla de verdad** de valores que muestra el mapeo de entrada a salida que es realizado por la puerta.

source: Figure 9: Three Types of Logic Gates
es_419: Figura 9: Tres Tipos de Compuertas Lógicas

source: By combining these gates in various patterns and then applying a set of input values, we can build circuits that have logical functions. :ref:`Figure 10 <fig_circuit1>` shows a circuit consisting of two AND gates, one OR gate, and a single NOT gate. The output lines from the two AND gates feed directly into the OR gate, and the resulting output from the OR gate is given to the NOT gate. If we apply a set of input values to the four input lines (two for each AND gate), the values are processed and a result appears at the output of the NOT gate. :ref:`Figure 10 <fig_circuit1>` also shows an example with values.
es_419: Al combinar estas puertas en varios patrones y luego aplicando a un conjunto de valores de entrada, podemos construir circuitos que tienen funciones lógicas. :ref:`La Figura 10 <fig_circuit1>` muestra un circuito que consta de dos puertas AND, una puerta OR y una única puerta NOT. Las líneas de salida de las dos puertas AND se alimentan directamente en la puerta OR y la salida resultante de la puerta OR se da a la puerta NOT. Si aplicamos un conjunto de valores de entrada a las cuatro líneas de entrada (dos para cada puerta AND), los valores se procesan y aparece un resultado en la salida de la puerta NOT. :ref:`Figura 10 <fig_circuit1>` también muestra un ejemplo con valores.

source: Figure 10: Circuit
es_419: Figura 10: Circuito

source: In order to implement a circuit, we will first build a representation for logic gates. Logic gates are easily organized into a class inheritance hierarchy as shown in :ref:`Figure 11 <fig_gates>`. At the top of the hierarchy, the ``LogicGate`` class represents the most general characteristics of logic gates: namely, a label for the gate and an output line. The next level of subclasses breaks the logic gates into two families, those that have one input line and those that have two. Below that, the specific logic functions of each appear.
es_419: Para implementar un circuito, primero construiremos una representación para puertas lógicas. Las puertas lógicas se organizan fácilmente en una jerarquía de herencia de clase como se muestra en :ref:`Figura 11 <fig_gates>`. En la parte superior de la jerarquía, la clase ``CompuertaLogica`` representa las características más generales de las puertas lógicas: esto es, una etiqueta para la puerta y una línea de salida. El siguiente nivel de subclases separa las puertas lógicas en dos familias, las que tienen una línea de entrada y las que tienen dos. Debajo de eso, aparecen las funciones lógicas específicas de cada una.

source: Figure 11: An Inheritance Hierarchy for Logic Gates
es_419: Figura 11: Una Jerarquía de Herencia para Las Compuertas Lógicas

source: We can now start to implement the classes by starting with the most general, ``LogicGate``. As noted earlier, each gate has a label for identification and a single output line. In addition, we need methods to allow a user of a gate to ask the gate for its label.
es_419: Ahora podemos empezar a implementar las clases empezando con el más general, ``CompuertaLogica``. Como se ha indicado anteriormente, cada puerta tiene una etiqueta para la identificación y una sola línea de salida. Además, necesitamos métodos para permitir que un usuario de una puerta preguntar a la puerta por su etiqueta.

source: The other behavior that every logic gate needs is the ability to know its output value. This will require that the gate perform the appropriate logic based on the current input. In order to produce output, the gate needs to know specifically what that logic is. This means calling a method to perform the logic computation. The complete class is shown in :ref:`Listing 8 <lst_logicgateclass>`.
es_419: El otro comportamiento que cada puerta lógica necesita es la capacidad de conocer su valor de salida. Esto requerirá que la puerta realice la lógica apropiada basada en la entrada actual. Con el fin de producir salida, la puerta tiene que saber específicamente cuál es la lógica. Esto significa llamar a un método para realizar el cálculo lógico. La clase completa se muestra en :ref:`Listado 8 <lst_logicgateclass>`.

source: **Listing 8**
es_419: **Listado 8**

source: class LogicGate: def __init__(self,n): self.label = n self.output = None def getLabel(self): return self.label def getOutput(self): self.output = self.performGateLogic() return self.output
es_419: class CompuertaLogica: def __init__(self,n): self.etiqueta = n self.salida = None def darEtiqueta(self): return self.etiqueta def darSalida(self): self.salida = self.realizarCompuertaLogica() return self.salida

source: At this point, we will not implement the ``performGateLogic`` function. The reason for this is that we do not know how each gate will perform its own logic operation. Those details will be included by each individual gate that is added to the hierarchy. This is a very powerful idea in object-oriented programming. We are writing a method that will use code that does not exist yet. The parameter ``self`` is a reference to the actual gate object invoking the method. Any new logic gate that gets added to the hierarchy will simply need to implement the ``performGateLogic`` function and it will be used at the appropriate time. Once done, the gate can provide its output value. This ability to extend a hierarchy that currently exists and provide the specific functions that the hierarchy needs to use the new class is extremely important for reusing existing code.
es_419: En este punto, no implementaremos la función ``realizarCompuertaLogica``. La razón de esto es que no sabemos cómo cada puerta llevará a cabo su propia operación lógica. Estos detalles serán incluidos por cada puerta individual que se añade a la jerarquía. Esta es una idea muy poderosa en la programación orientada a objetos. Estamos escribiendo un método que usará código que aún no existe. El parámetro ``self`` es una referencia al objeto real puerta que invoca el método. Cualquier nueva puerta lógica que se agregue a la jerarquía simplemente tendrá que implementar la función ``realizarCompuertaLogica`` y se utilizará en el momento apropiado. Una vez hecho, la puerta puede proporcionar su valor de salida. Esta capacidad de extender una jerarquía que existe actualmente y proporcionar las funciones específicas que la jerarquía necesita para usar la nueva clase es extremadamente importante para reutilizar el código existente.

source: We categorized the logic gates based on the number of input lines. The AND gate has two input lines. The OR gate also has two input lines. NOT gates have one input line. The ``BinaryGate`` class will be a subclass of ``LogicGate`` and will add two input lines. The ``UnaryGate`` class will also subclass ``LogicGate`` but will have only a single input line. In computer circuit design, these lines are sometimes called “pins” so we will use that terminology in our implementation.
es_419: Hemos clasificado las puertas lógicas en función del número de líneas de entrada. La puerta AND tiene dos líneas de entrada. La puerta OR también tiene dos líneas de entrada. Las puertas NOT tienen una línea de entrada. La clase ``CompuertaBinaria`` será una subclase de `` LogicGate`` y añadirá dos líneas de entrada. La clase ``CompuertaUnaria`` también subclasará ``CompuertaLogica``, pero solo tendrá una sola línea de entrada. En el diseño de circuitos de ordenador, estas líneas a veces se llaman "pines (pins)" por lo que vamos a utilizar esa terminología en nuestra aplicación.

source: **Listing 9**
es_419: **Listado 9**

source: class BinaryGate(LogicGate): def __init__(self,n): LogicGate.__init__(self,n) self.pinA = None self.pinB = None def getPinA(self): return int(input("Enter Pin A input for gate "+ self.getLabel()+"-->")) def getPinB(self): return int(input("Enter Pin B input for gate "+ self.getLabel()+"-->"))
es_419: class CompuertaBinaria(CompuertaLogica): def __init__(self,n): CompuertaLogica.__init__(self,n) self.pinA = None self.pinB = None def darPinA(self): return int(input("Ingrese la entrada para el Pin A de la compuerta "+ self.darEtiqueta()+"-->")) def darPinB(self): return int(input("Ingrese la entrada para el Pin B de la compuerta "+ self.darEtiqueta()+"-->"))

source: **Listing 10**
es_419: **Listado 10**

source: class UnaryGate(LogicGate): def __init__(self,n): LogicGate.__init__(self,n) self.pin = None def getPin(self): return int(input("Enter Pin input for gate "+ self.getLabel()+"-->"))
es_419: class CompuertaUnaria(CompuertaLogica): def __init__(self,n): CompuertaLogica.__init__(self,n) self.pin = None def getPin(self): return int(input("Ingrese la entrada para el Pin de la compuerta "+ self.darEtiqueta()+"-->"))

source: :ref:`Listing 9 <lst_logicgateclass>` and :ref:`Listing 10 <lst_logicgateclass>` implement these two classes. The constructors in both of these classes start with an explicit call to the constructor of the parent class using the parent's ``__init__`` method. When creating an instance of the ``BinaryGate`` class, we first want to initialize any data items that are inherited from ``LogicGate``. In this case, that means the label for the gate. The constructor then goes on to add the two input lines (``pinA`` and ``pinB``). This is a very common pattern that you should always use when building class hierarchies. Child class constructors need to call parent class constructors and then move on to their own distinguishing data.
es_419: :ref:`Listado 9 <lst_logicgateclass>` y :ref:`Listado 10 <lst_logicgateclass>` implementan estas dos clases. Los constructores en ambas clases comienzan con una llamada explícita al constructor de la clase padre utilizando el método ``__init__`` del padre. Al crear una instancia de la clase ``CompuertaBinaria``, primero queremos inicializar cualquier elemento de datos heredado de ``CompuertaLogica``. En este caso, eso significa la etiqueta para la puerta. A continuación, el constructor agrega las dos líneas de entrada (``pinA`` y ``pinB``). Este es un patrón muy común que se debe utilizar siempre al crear jerarquías de clases. Los constructores de clase hija deben llamar a los constructores de las clases de padres y luego pasar a sus propios datos de distinción.

source: Python also has a function called ``super`` which can be used in place of explicitly naming the parent class. This is a more general mechanism, and is widely used, especially when a class has more than one parent. But, this is not something we are going to discuss in this introduction. For example in our example above ``LogicGate.__init__(self,n)`` could be replaced with ``super(UnaryGate,self).__init__(n)``.
es_419: Python también tiene una función llamada ``super`` que se puede usar en lugar de nombrar explícitamente la clase padre. Este es un mecanismo más general, y es ampliamente utilizado, especialmente cuando una clase tiene más de un padre. Pero, esto no es algo que vamos a discutir en esta introducción. Por ejemplo, en nuestro ejemplo anterior, ``CompuertaLogica.__init__(self, n)`` podría ser reemplazado por ``super(CompuertaUnaria,self).__init__(n)``.
