Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/ObjectOrientedProgramminginPythonDefiningClasses.po
Languages: es_419

source: class LogicGate: def __init__(self,n): self.name = n self.output = None def getName(self): return self.name def getOutput(self): self.output = self.performGateLogic() return self.output class BinaryGate(LogicGate): def __init__(self,n): LogicGate.__init__(self,n) self.pinA = None self.pinB = None def getPinA(self): if self.pinA == None: return int(input("Enter Pin A input for gate "+self.getName()+"-->")) else: return self.pinA.getFrom().getOutput() def getPinB(self): if self.pinB == None: return int(input("Enter Pin B input for gate "+self.getName()+"-->")) else: return self.pinB.getFrom().getOutput() def setNextPin(self,source): if self.pinA == None: self.pinA = source else: if self.pinB == None: self.pinB = source else: print("Cannot Connect: NO EMPTY PINS on this gate") class AndGate(BinaryGate): def __init__(self,n): BinaryGate.__init__(self,n) def performGateLogic(self): a = self.getPinA() b = self.getPinB() if a==1 and b==1: return 1 else: return 0 class OrGate(BinaryGate): def __init__(self,n): BinaryGate.__init__(self,n) def performGateLogic(self): a = self.getPinA() b = self.getPinB() if a ==1 or b==1: return 1 else: return 0 class UnaryGate(LogicGate): def __init__(self,n): LogicGate.__init__(self,n) self.pin = None def getPin(self): if self.pin == None: return int(input("Enter Pin input for gate "+self.getName()+"-->")) else: return self.pin.getFrom().getOutput() def setNextPin(self,source): if self.pin == None: self.pin = source else: print("Cannot Connect: NO EMPTY PINS on this gate") class NotGate(UnaryGate): def __init__(self,n): UnaryGate.__init__(self,n) def performGateLogic(self): if self.getPin(): return 0 else: return 1 class Connector: def __init__(self, fgate, tgate): self.fromgate = fgate self.togate = tgate tgate.setNextPin(self) def getFrom(self): return self.fromgate def getTo(self): return self.togate def main(): g1 = AndGate("G1") print(g1.getOutput()) main()
es_419: class CompuertaLogica: def __init__(self,n): self.etiqueta = n self.salida = None def darEtiqueta(self): return self.etiqueta def darSalida(self): self.salida = self.realizarCompuertaLogica() return self.salida class CompuertaBinaria(CompuertaLogica): def __init__(self,n): CompuertaLogica.__init__(self,n) self.pinA = None self.pinB = None def darPinA(self): if self.pinA == None: return int(input("Ingrese la entrada para el Pin A de la compuerta "+ self.darEtiqueta()+"-->")) else: return self.pinA.darOrigen().darSalida() def darPinB(self): if self.pinB == None: return int(input("Ingrese la entrada para el Pin B de la compuerta "+ self.darEtiqueta()+"-->")) else: return self.pinA.darOrigen().darSalida() def ponerProxPin(self, origen): if self.pinA == None: self.pinA = origen else: if self.pinB == None: self.pinB = origen else: raise RuntimeError("Error: SIN PINS VACIOS") class CompuertaY(CompuertaBinaria): def __init__(self,n): CompuertaBinaria.__init__(self, n) def realizarCompuertaLogica(self): a = self.darPinA() b = self.darPinB() if a==1 and b==1: return 1 else: return 0 class CompuertaO(CompuertaBinaria): def __init__(self,n): CompuertaBinaria.__init__(self, n) def realizarCompuertaLogica(self): a = self.darPinA() b = self.darPinB() if a==1 or b==1: return 1 else: return 0 class CompuertaUnaria(CompuertaLogica): def __init__(self,n): CompuertaLogica.__init__(self,n) self.pin = None def darPin(self): if self.pin == None: return int(input("Ingrese la entrada para el Pin de la compuerta "+ self.darEtiqueta()+"-->")) else: return self.pin.darOrigen().darSalida() def ponerProxPin(self, origen): if self.pin == None: self.pin = origen else: raise RuntimeError("Error: SIN PINS VACIOS") class CompuertaNO(CompuertaUnaria): def __init__(self, n): CompuertaUnaria.__init__(self, n) def realizarCompuertaLogica(self): if self.darPin(): return 0 else: return 1 class Conector: def __init__(self, dpuerta, apuerta): self.depuerta = dpuerta self.apuerta = apuerta apuerta.ponerProxPin(self) def darOrigen(self): return self.depuerta def darDestino(self): return self.apuerta def principal(): g1 = CompuertaY("G1") print(g1.darSalida()) principal()
