Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/ProgrammingExercises.po
Languages: es_419

source: Programming Exercises
es_419: Ejercicios de Programación

source: Implement the simple methods ``getNum`` and ``getDen`` that will return the numerator and denominator of a fraction.
es_419: Implemente los métodos ``getNum`` y ``getDen`` que retornen el numerador y el denominador de una fracción

source: In many ways it would be better if all fractions were maintained in lowest terms right from the start. Modify the constructor for the ``Fraction`` class so that ``GCD`` is used to reduce fractions immediately. Notice that this means the ``__add__`` function no longer needs to reduce. Make the necessary modifications.
es_419: De muchas maneras sería mejor si todas las fracciones se mantuvieran en los términos correctos más bajos desde el inicio. Modifique el constructor de la clase ``Fraction`` para que ``GCD`` se use para reducir fracciones inmediatamente. Observe que esto significa que la función ``__add__`` ya no necesita reducir. Haga las modificaciones necesarias.

source: Implement the remaining simple arithmetic operators (``__sub__``, ``__mul__``, and ``__truediv__``).
es_419: Implemente los demás operadores aritméticos simples (``__sub__``, ``__mul__``, and ``__truediv__``).

source: Implement the remaining relational operators (``__gt__``, ``__ge__``, ``__lt__``, ``__le__``, and ``__ne__``)
es_419: Implemente los demás operadores relacionales (``__gt__``, ``__ge__``, ``__lt__``, ``__le__``, and ``__ne__``)

source: Modify the constructor for the fraction class so that it checks to make sure that the numerator and denominator are both integers. If either is not an integer the constructor should raise an exception.
es_419: Modifique el constructor para la clase fraction de modo que compruebe que el numerador y el denominador son ambos enteros. Si no es un entero, el constructor debe generar una excepción.

source: In the definition of fractions we assumed that negative fractions have a negative numerator and a positive denominator. Using a negative denominator would cause some of the relational operators to give incorrect results. In general, this is an unnecessary constraint. Modify the constructor to allow the user to pass a negative denominator so that all of the operators continue to work properly.
es_419: En la definición de fracciones asumimos que las fracciones negativas tienen un numerador negativo y un denominador positivo. El uso de un denominador negativo haría que algunos de los operadores relacionales dieran resultados incorrectos. En general, esto es una restricción innecesaria. Modifique el constructor para permitir que el usuario pase un denominador negativo de tal manera que todos los operadores continúen trabajando correctamente.

source: Research the ``__radd__`` method. How does it differ from ``__add__``? When is it used? Implement ``__radd__``.
es_419: Investiga el método ``__radd__``. ¿En qué se diferencia de ``__add__``? ¿Cuándo se utiliza? Implementar ``__radd__``.

source: Repeat the last question but this time consider the ``__iadd__`` method.
es_419: Repita la última pregunta, pero esta vez considere el método ``__iadd__``.

source: Research the ``__repr__`` method. How does it differ from ``__str__``? When is it used? Implement ``__repr__``.
es_419: Investigue el método ``__repr__``. ¿En qué se diferencia de ``__str__``? ¿Cuándo se utiliza? Implemente ``__repr__``.

source: Research other types of gates that exist (such as NAND, NOR, and XOR). Add them to the circuit hierarchy. How much additional coding did you need to do?
es_419: Investigue otros tipos de puertas que existen (como NAND, NOR, y XOR). Añadirlos a la jerarquía del circuito. ¿Cuánta codificación adicional necesitabas hacer?

source: The most simple arithmetic circuit is known as the half-adder. Research the simple half-adder circuit. Implement this circuit.
es_419: El circuito aritmético más simple se conoce como el sumador-medio (half-adder). Investigue el circuito simple half-adder. Implemente este circuito.

source: Now extend that circuit and implement an 8 bit full-adder.
es_419: Ahora extienda ese circuito e implemente un sumador completo (full-adder) de 8-bit.

source: The circuit simulation shown in this chapter works in a backward direction. In other words, given a circuit, the output is produced by working back through the input values, which in turn cause other outputs to be queried. This continues until external input lines are found, at which point the user is asked for values. Modify the implementation so that the action is in the forward direction; upon receiving inputs the circuit produces an output.
es_419: La simulación de circuito que se muestra en este capítulo funciona en sentido inverso. En otras palabras, dado un circuito, la salida es producida por el trabajo inverso a través de los valores de entrada, que a su vez causan otras salidas a ser consultadas. Esto continúa hasta que se encuentran líneas de entrada externas, en cuyo punto se pide al usuario valores. Modifique la implementación para que la acción esté en la dirección hacia adelante; al recibir entradas el circuito produce una salida.

source: Design a class to represent a playing card. Now design a class to represent a deck of cards. Using these two classes, implement a favorite card game.
es_419: Diseña una clase para representar un juego de cartas. Ahora diseñe una clase para representar una baraja de cartas. Usando estas dos clases, implementa su juego de cartas favorito.

source: Find a Sudoku puzzle in the local newspaper. Write a program to solve the puzzle.
es_419: Encuentre un rompecabezas de Sudoku en un periódico local. Escribe un programa para resolver el rompecabezas
