Repository: UniversidadDelEste/pythonds
Catalog: locale/*/LC_MESSAGES/Introduction/Summary.po
Languages: es_ar

source: Summary
es_ar: Sumario

source: Computer science is the study of problem solving.
es_ar: La informática es el estudio de la resolución de problemas.

source: Computer science uses abstraction as a tool for representing both processes and data.
es_ar: La informática utiliza la abstracción como una herramienta para representar tanto los procesos como los datos.

source: Abstract data types allow programmers to manage the complexity of a problem domain by hiding the details of the data.
es_ar: Los tipos de datos abstractos permiten a los programadores administrar la complejidad de un dominio de problema ocultando los detalles de los datos.

source: Python is a powerful, yet easy-to-use, object-oriented language.
es_ar: Python es un poderoso, pero fácil de usar, el lenguaje orientado a objetos.

source: Lists, tuples, and strings are built in Python sequential collections.
es_ar: Las listas, tuplas y cadenas se crean en colecciones secuenciales de Python.

source: Dictionaries and sets are nonsequential collections of data.
es_ar: Los diccionarios y conjuntos son colecciones no secuenciales de datos.

source: Classes allow programmers to implement abstract data types.
es_ar: Las clases permiten que los programadores implementen tipos de datos abstractos.

source: Programmers can override standard methods as well as create new methods.
es_ar: Los programadores pueden anular los métodos estándar, así como crear nuevos métodos.

source: Classes can be organized into hierarchies.
es_ar: Las clases pueden organizarse en jerarquías.

source: A class constructor should always invoke the constructor of its parent before continuing on with its own data and behavior.
es_ar: Un constructor de clase siempre debe invocar al constructor de su padre antes de continuar con sus propios datos y comportamiento.
